const emergencyScenarios = [
    {
        id: 1,
        color:"#ffa133",
        situation: `מעמ"ל`,
        description: "מצב של הכנה למלחמה או איומים ביטחוניים.",
        notes: [
          "ניצול 'זמן יקר' וצמצום זמן התגובה הראשונית",
          "ארגון תמונת מצב אוכלוסיה (מתעדכנת)",
          "בדיקת ציוד ותשתיות והכנתם לשימוש מיידי",
          "מעבר מהיר לאירועי חירום",
          `ראשי צוותי מעדכנים את היו"ר על מצב המוכנות של הצוות שלהם - איוש, ציוד, משמרות, זמינות, המלצות להמשך`
      ],
        roles: [
          {
              role: `יו"ר צח"י`,
              id:1,
              tasks:[
                  "קבלת עדכון תמונת מצב מדינה/גזרה מהמועצה",
                  "וידוא יצירת מודיעין אוכלוסיה תושבים/אורחים",
                  "הפעלת משמרות 24/7 בחמ\"ל הצח\"י והגדרת נהלי התכנסות",
                  "שליטה באוכלוסייה ע\"י מודיעין ומידע לציבור",
                  "העברת עדכון חצי יומי / יומי למועצה",
                  "תאום מועד ומקום לכינוס הצוות"
              ],
                color: "#22B573"
            },
            {
              role: "ביטחון",
              id:2,
              tasksByPhases: { "משימות": [
                  "בדיקת זמינות אנשי הצוות",
                  "בדיקת תקינות ציוד - עגלות קיימות",
                  "איגום משאבי חילוץ וכיבוי - ג'קים, לומים בולי עץ",
                  "בדיקת תקינות צירי תנועה וצירים חלופיים",
                  "הגדרת שדכנים בשער היישוב למקרה אירועים"
              ]},
              color:"#00AAD1"
            },
            {
              role: "אוכלוסייה",
              id:3,
              tasksByPhases: { "משימות": [
                  "בדיקת זמינות אנשי הצוות",
                  "יצירת תמונת מצב מודיעין אוכלוסייה: מי ביישוב, בעבודה, בחו\"ל ומי מנותק קשר",
                  "יצירת תמונת מצב אורחים (כולל מפונים/מתפנים) - מי נקלט ביישוב",
                  "בירור לגבי אוכלוסייה חלשה/נפגעי חרדה (גם בשקט), זקוקים לסיוע צמוד (רפואי/נפשי)",
                  "יצירת מענה תומך למשפחות בהן אחד ההורים במילואים/חו\"ל"
              ]},
              color:"#FF6D01"
    
            },
            {
              role: "לוגיסטיקה",
              id:4,
              tasksByPhases: { "משימות": [
                  "בדיקת זמינות אנשי הצוות",
                  "בדיקת ציוד לוגיסטי וזמינותו - טרקטורים, כלל אמצעי כיבוי, אמצעי חשמל, גז, תאורה",
                  "הכשרת דרכי כניסה ויציאה מהיישוב והמלצה על התוואי לביטחון של הצח\"י",
                  "מיפוי חומרים מסוכנים והמלצה לטיפול במידת הצורך",
                  "יצירת רשימה ליו\"ר - ציוד לוגיסטי זמין"
              ]},
              color:"#FFA133"
    
            },
            {
              role: "מידע לציבור",
              id:5,
              tasksByPhases: { "משימות": [
                  "בדיקת זמינות אנשי הצוות",
                  "הוצאת הודעה על שגרת היישוב - הודעה פעם בחצי יום או פעם ביממה",
                  "מעבר על הודעות נצורות רלוונטיות לתרחיש החירום (מלחמה, שריפה וכו')",
                  "הודעה על טלפון חרום של מרכז מידע לציבור (לא החמ\"ל!)",
                  "ווידוא תקינות קו הטלפון של מרכז פניות תושבים"
              ]},
              color:"#9F2B68"
    
            },
            {
              role: `חמ"ל`,
              id:6,
              tasksByPhases: { "משימות": [
                "בדיקת זמינות אנשי הצוות",
                "פתיחת חמ”ל ויומן מבצעים",
                "מעבר על טלפונים חיוניים",
                "יצירת קשר “לחיצת יד” עם גורמים חיוניים",
                "בדיקת קשר פנימי ומול המועצה"
              ]},
              color:"#EA4335"
    
            },
          
        ]
      },
  
   
    {
      id: 2,
      color:"#e06666",
      situation: "מלחמה",
      description: "מצב חירום עקב התקפה צבאית.",
      notes: [
        "שעות ראשונות/ ימים ראשונים מורכבים במיוחד - נזק לתשתיות ומורל",
        "ירוע מתמשך למשך מספר שבועות - נפגעי חרדה, הפסקות לימודים - שיבוש שגרה",
        "חוסן היישוב מושפע ישירות מהיכולת לקיים שגרת חיים",
        "תמיכה למשפחות של מגוייסים - בשירות חובה ומילואים",
        "קליטה ספונטנית וקליטה מסודרת של תושבים מאזורי הלחימה",
        "סבירות גבוהה להפסקות חשמל/מים ממושכות",
        "היערכות לנפילות טילים שמחוללים: שריפות, אתרי הרס, נפגעים, חרדות, נזק לתשתיות"
        ],
        roles : [
            {
              role: `יו"ר צח"י`,
              id: 1,
              tasksByPhases: {
                "לפני האירוע": [
                  "קבלת הנחיות התגוננות פקע\"ר מהמועצה והבנת המשמעויות בדגש על לימודים"
                ],
                "במהלך האירוע": [
                  "הגדרת שגרת חירום לצח\"י וליישוב יחד עם הנהלת היישוב",
                  "לפעול לעיבוי מתנדבי צח\"י בכל הצוותים ע\"ב מתנדבים חדשים אד הוק",
                  "עבודה עם מנהל קהילה על יצירת מענה קהילתי ולו\"ז קבוע של שגרת חירום של היישוב"
                ],
                "אחרי האירוע": [
                  "היערכות לקליטת אוכלוסייה - בדגש על 'לעזור להם לעזור לעצמם'",
                  "היערכות לקליטת מתנדבים בודדים/אירגונים"
                ]
              },
              color: "#22B573"
            },
            {
              role: "ביטחון",
              id: 2,
              tasksByPhases: {
                "לפני האירוע": [
                  "קבלת עדכונים יומיים מקב\"ט המועצה"
                ],
            
              },
              color: "#00AAD1"
            },
            {
              role: "אוכלוסייה",
              id: 3,
              tasksByPhases: {
                "לפני האירוע": [
                  "המלצה לתוכנית סיוע לאוכלוסייה חלשה",
                  "ביצוע קשר לאוכלוסיות ולמוסדות מיוחדים ביישוב"
                ],
                "במהלך האירוע": [
                  "היערכות להפסקת לימודים ו/או למידה מרחוק",
                  "רתימת הנוער והכנת החינוך הבלתי פורמאלי (תכנית למידה חלופית)"
                ],
                "אחרי האירוע": [
                  "סיוע מקצועי לקליטת האורחים",
                  "יציות שמרטפייה למתנדבי צח\"י"
                ]
              },
              color: "#FF6D01"
            },
            {
              role: "לוגיסטיקה",
              id: 4,
              tasksByPhases: {
                "לפני האירוע": [
                  "היערכות לנפילות טילים / זירות הרס",
                  "יצירת שמרטפייה למתנדבי צח\"י"
                ],
                "אחרי האירוע": [
                  "הכנות לוגיסטיות לקליטה"
                ]
              },
              color: "#FFA133"
            },
            {
              role: "מידע לציבור",
              id: 5,
              tasksByPhases: {
                "לפני האירוע": [
                  "פרסום הנחיות פקע\"ר והמועצה בדגש על הנחיות. אזור התראה רלוונטי ומציאת \"הכי מוגן שיש\"."
                ],
                "במהלך האירוע": [
                  "הודעה כל חצי יום עדכונים (מידע בדחיפה) מתי יצא העדכון הבא"
                ],
                "אחרי האירוע": [
                  "עדכון התושבים בנעשה בדגש על האורחים ביישוב (יצירת קבוצת קשר נוספת על תושבי הקבע ביישוב)"
                ]
              },
              messages:[
                "נשמע רעש נפילה בשטחי הישוב שימו לב, כוחות הביטחון סורקים את שטח הנפילה, טרם ידוע על נפגעים או נזק, יש להישאר במרחבים המוגנים עד להודעה חדשה ולהקפיד על הנחיות פיקוד העורף. הודעה נוספת תצא בהקדם. לדיווחים דחופים: (מס‘ טלפון)",
                "נציגי המשפחות מתבקשים להשיב על הודעת בדיקת הנוכחות בקבוצות הווטסאפ או קישור למסמך.",
                "לצערנו יש נפגעים )פירוט, כולל האם מדא בדרך או בשטח( יש להישאר בבתים ולא להפריע לכוחות ההצלה. לדיווחים: )מס‘ טלפון(.",
                "חזרה לשגרה. אפשר לצאת מהמרחבים המוגנים, אנא הישארו בקרבת מרחב מוגן."
              ],
              color: "#9F2B68",
         
            },
            {
              role: `הנהלת ישוב`,
              id: 6,
              tasksByPhases: {
                "לפני האירוע": [
                  "חבירה לצח\"י ויצירת נהלי ישוב לחירום וסדר יום מוגדר כולל הערכות מצב יומיות וקשר עם תושבים"
                ],
                "במהלך האירוע": [
                  "תכנית תמיכה למשפחות - מגויסים למילואים, נזקקים, מאובחנים"
                ],
                "אחרי האירוע": [
                  "עבודה משותפת עם כל הצח\"י ליצירת מענה משלים קהילתי"
                ]
              },
              color: "#934e2b"
            }
          ],
    },
    {
      id: 3,
      color:"#e06666",
      situation: "תקיפת ישוב",
      description: "מצב חירום כאשר הישוב מותקף.",
      notes: [
        "השהייה מקסימלית של התוקפים ממגע עם האוכלוסיה",
        "מזעור למינימום האפשרי את החשיפה של האוכלוסייה לתוקפים",
        "לאפשר התערבות מהירה של כוחות ביטחון, רפואה וחילוץ",
        "התארגנות לפינוי האוכלוסייה במצב בטוח, גם תוך כדי לחימה, דרך מסדרון בטוח ליציאה",
        "פינוי האוכלוסייה בבטחה למקום מוגן"
    ],
      roles: [
        {
          role: `יו"ר צח"י`,
          id:1,
          tasks:[
            "נוכחות חברי צח\"י",
            "מינוי חבר ל'ירוק בעיניים' (מניפה - מיפוי מיקום תושבים)",
            "הודעה (יחד עם מידע)",
            "סטטוס בבתים - כל 15 דקות"
        ],
            color: "#22B573"
        },
        {
          role: "ביטחון",
          id:2,
            tasksByPhases: { "משימות": [
            "כיתת כוננות + מפקד",
            "חלוקת גזרות",
            "קשר",
            "נוה\"ק",
            "הפעלת חמ\"ל",
            "איש קשר לצח\"י",
            "סגירת שערי יישוב + הגנה",
            "מיקום תצפית בנקודות שולטות",
            "הזעקת כוחות ביטחון, חילוץ והצלה",
            "הפעלת נושאי נשק ביישוב",
            "צוות רפואי"
        ]},
          color:"#00AAD1"
        },
        {
          role: "אוכלוסייה",
          id:3,
            tasksByPhases: { "משימות": [
            "מיפוי אוכלוסיות רגישות",
            "מניפה",
            "תוכנית פינוי (יחד עם ביטחון ולוגיסטיקה)"
        ]},
          color:"#FF6D01"

        },
        {
          role: "לוגיסטיקה",
          id:4,
            tasksByPhases: { "משימות": [
            "סגירת שערים",
            "רכבי פינוי אוכלוסייה",
            "רכבי פינוי רפואי",
            "חשמלאי",
            "מקלטים ומרחבים ממוגנים",
            "צוות כיבוי וחילוץ"
        ]},
          color:"#FFA133"

        },
        {
          role: "מידע לציבור",
          id:5,
            tasksByPhases: { "משימות": [  "הודעה לתושבים ביישוב",
            "הודעה לתושבים מחוץ ליישוב",
            "נתיבי תנועה מותרים ומחסומים שמונעים הגעה",
            "עדכונים לתושבים תמונת מצב.",
            "להיות בקשר רציף מול דובר המועצה ומול התקשורת – שתהיה לתקשורת כתובת אחת מרכזית למידע",
            "הודעות יישוביות מעדכנות (דילמת האסיר עד כמה לעדכן)",
            "להיות בקשר רציף מול דובר המועצה ומול התקשורת",
            "שתהיה לתקשורת כתובת אחת מרכזית למידע"]},
          color:"#9F2B68"

        },
        {
          role: "חינוך",
          id:6,
            tasksByPhases: { "משימות": [
            "הנחיות למסגרות חינוך",
            "שליטה במיקום תלמידים + איש צוות"
        ]},
          color:"#8B008B"

        },
      ]
    },
    {
        id: 4,
        color:"#e06666",
        situation: "פינוי ישוב",
        description: "מצב חירום שבו יש צורך לפנות את הישוב.",
        notes: "ודא שהפינוי מתבצע בצורה מסודרת ובטוחה.",
        infos:{
          "הנחות יסוד":[
            "ההחלטה על פינוי אינה פשוטה - שיקולים רבים",
            "מצב נפשי מורכב של תושבים",
            "היישוב אינו יכול לבצע את הפינוי בכוחות עצמו",
            "חלק יתפנו עצמאית",
            "הפינוי יהיה במצב דוחק - זמן הינו מרכיב קריטי",
            "חפ\"ק אחוד (כוחות חירום/מועצה/יישוב) - משמעות קריטית",
            "פינוי סדור - כלל התושבים יפונו",
            "פינוי חפוז",
            "פינוי מילוט - ללא מקום קליטה מוגדר"
        ],
          "אחריות":[
            "פנים יישוב כלפי התושבים - צח\"י והנהלת יישוב",
            "הסעות - מועצה",
            "חפ\"ק אחוד (משטרה, כב\"ה, מועצה) - קב\"ט",
            "נפ\"קים - משטרה",
            "כיבוי השריפה - כב\"ה",
            "אחריות כוללת על האירוע - משטרה",
            "תיאום מקום אליו יפונו - מועצה - או פנים יישובי (צח\"י והנהלת יישוב)"
        ],
          "שלבי היערכות/ביצוע":[
            "היערכות מקדימה בשגרה",
            "א. מיפוי והכנת הציוד",
            "ב. מיפוי והכנת האוכלוסייה",
            "ג. הכנת תוכנית קליטה למפונים",
            "ד. הכנת תוכנית לנפגעי חרדה",
            "ה. קביעת מיקומי פינוי והכשרתם לקליטה (תושבים, פצועים, נפגעי חרדה)",
            "ו. הפעלת הנוער לסיוע"
        ],
          "מפינוי והכנת הציוד":[
            "מיפוי סיכונים (קרבה ליערות, חשמל וכו')",
            "דרכי גישה חלופיות (כולל מפתחות לשערים)",
            "מיקומי הידראנטים ונקודות מים (להבין איפה אין כיסוי מספק)",
            "מיקומי צינורות/ערכות התחברות להידראנטים",
            "מיקום ציוד חקלאי - טרקטורים, שופלים, מרססים",
            "העלאת כלל הדברים על ה-GIS של המועצה",
            "קניית ערכות עפ\"י רשימה מומלצת מהקב\"ט"
        ],
        "הכנות ביתיות":[
          "תרופות - כגון אקמול לילדים/מבוגרים, כאבי ראש וכו...",
          "בקבוקי מים - ליטר לאדם",
          "קופת חולים - כרטיס חכם",
          "מסמכים אישיים - מה באמת חשוב לקחת ברגע האמת?"
      ],
          "צרכים מיוחדים":[
            "שם פרטי ומשפחה",
            "תרופות חיוניות",
            "רגישות למוצרים / תרופות",
            "אפוטרופוס ודרכי קשר"
        ]
        }
      },
    {
        id: 5,
        color:"#e06666",
        situation: "פינוי בתי ספר",
        description: "מצב חירום      .",
        notes: [
          "פינוי בי\"ס או כל מוסד חינוכי באישור/הנחייה של ראש הרשות",
          "תיאומי כלל הגופים באחריות המועצה",
          "תיאומי יישוב באחריות היישוב",
          "התנהלות מול חמ\"ל מועצה ולא ישירות מול כל ביה\"ס",
          "סיכוי גבוה שחלק ניכר מהצח\"י לא יהיה ביישוב בזמן החלטה על פיזור מיידי של תלמידים לבתים",
          "כלל – יד לוחצת יד – תלמיד עובר מאחריות מבוגר אחד לשני",
          "במקרה של פינוי במלחמה – יינתנו הנחיות בהתאם למצב"
      ]
      ,
        roles : [
          {
            role: `יו"ר צח"י`,
            id: 1,
            tasksByPhases: {
              "בשגרה": [
                "הכרת תכנית המגירה וגזירת משמעויות"
              ],
              "במהלך האירוע": [
                "קבלת פקודה מהמועצה, לו\"ז להגעת התלמידים, מספר אוטובוסים ומיקום",
                "וידוא ארגון מקום קליטה עם נציג מהצח\"י",
                "מעבר על הרשימות ווידוא הגעת כלל התלמידים יחד עם מכלול אוכלוסייה",
                "יצירת רציפות תפקודית ביישוב – עיבוי מערכת החינוך במנדבים אד הוק (הורים וכד‘)"
              ]

            },
            color: "#22B573"
          },
          {
            role: "ביטחון",
            id: 2,
            tasksByPhases: {
              "בשגרה": [
                "הכרת תכנית המגירה וגזירת משמעויות"
              ],
            "במהלך האירוע": [
                "בדיקת צירים והעברת דיווח ליו\"ר צח\"י ולחמ\"ל מועצה",
                "מציאת צירים חלופיים במידה וישנו צורך (חסימה - הצפה, שריפה וכד‘)",
                "חבירה לאוטובוסים בסמוך לנקודות בעייתיות (צומת שעלולה להיחסם וכד‘)",
                "יצירת 'carpool' של רכבים ו/או רכבי שטח במידה והאוטובוס אינו יכול להגיע"
            ]
            },
            color: "#00AAD1"
          },
          {
            role: "אוכלוסייה",
            id: 3,
            tasksByPhases: {
              "בשגרה": [
                "שליטה מלאה ועדכנית על כלל תלמידי היישוב בחינוך הפורמאלי לפי מוסדות חינוך"
              ],
             "במהלך האירוע": [
                "יצירת מודיעין עדכני של התלמידים - מי בביה\"ס ובאיזה, מי בבית וכו‘",
                "יצירת מרחב בטוח לקליטת התלמידים עם מדריכים קולטים במבנה שיוקצה על ידי היישוב",
                "ניהול רישום קפדני של תלמידים מההגעה ליישוב עד להעברת הילד/ים לאחריות ההורים",
                "ארגון פעילות אלטרנטיבית/בלתי פורמאלית עד הגעת ההורים",
                "הכנת תכנית לימודים או 'למידה מרחוק' או על בסיס חינוך בלתי פורמאלי לתקופה בה לא יתקיימו לימודים"
              ]
            },
            color: "#FF6D01"
          },
          {
            role: "לוגיסטיקה",
            id: 4,
            tasksByPhases: {
              "בשגרה": [
                " הכנת תכנית מגירה של היישוב לנושא יחד עם מנהל הקהילה והנהלת היישוב"
              ],
              "במהלך האירוע": [
                "הכרת תכנית המגירה וגזירת משמעויות",
                "ארגון מקום מתאים (חם/יבש/ממוגן) לקליטת כלל התלמידים",
                "ארגון מזון ושתייה לתלמידים ומדריכים",
                "יצירת נתיבי נסיעה חלופיים במידת הצורך"
              ]

            },
            color: "#FFA133"
          },
          {
            role: "מידע לציבור",
            id: 5,
            tasksByPhases: {
              "בשגרה": [
                "הכנת הודעות נצורות בהתאם לתכנית המגירה"
              ],
           "במהלך האירוע": [
                "הודעה להורים בהתאם ללו\"ז מועצה",
                "עדכון הורים במיקום התלמידים",
                "עדכון הורים בפעילות והתארגנות של היישוב",
                "עדכון על סיום פיזור התלמידים ובנוהל קבלת הילדים אליהם"
            ]


            },
            color: "#9F2B68"
          },
          {
            role: `הנהלת ישוב`,
            id: 6,
            tasksByPhases: {
            "בשגרה": [
                "הכנת תכנית מגירה של היישוב לנושא יחד עם הצח\"י"
              ],
              "במהלך האירוע": [
                  "הפעלת מערכת החינוך הבלתי פורמאלית ביישוב",
                  "העמדת אמצעים לרשות הצח\"י",
                  "סיוע ביצירת מודיעין אוכלוסייה תלמידים והורים",
                  "לקצאת משאבים מיוחדים למערכת החינוך היישובית עד לחזרה ללימודים"
              ]

            },
               color: "#934e2b"
          }
        ],
       
        
      },

      {
        id: 6,
        color:"#e06666",
        situation: "קריסת מבנה",
        description: "מצב חירום כאשר מבנה מתמוטט.",
        notes: [
            "נזק מרחבי מעבר לזירה עצמה",
            "נפגעים מוכרים מהיישוב - הודעות מידע לציבור והפעלת נערים",
            "הוצאת דרישה לאמצעים וסיוע כמה שיותר מהר",
            "דגש על יצירת מודיעין אוכלוסייה בזירה - מי בדיוק היה בה רגע לפני הפגיעה/קריסה"
        ],
        roles: [
            {
                role: `יו"ר צח"י`,
                id:1,
                tasks:[
                    "יצירת תמ\"צ יישוב וזירה מי נוכח, מי צריך סיוע, מי מנותק קשר",
                    "קבלת תמונת מצב ממנהל זירה ואיחוד התמונה עם אוכלוסייה",
                    "אירגון צוותי חילוץ ומוכנות לקבלת סיוע מיישובים",
                    "שליטה בכמות נפגעים, חרדה, והודעות למשפחה",
                    "שליטה באוכלוסייה ע\"י מודיעין ומידע לציבור",
                    "היערכות למענה למחוסרי גג",
                    "הודעות עדכון למועצה"
                ],
                  color: "#22B573"
              },
              {
                role: "ביטחון",
                id:2,
                tasksByPhases: { "משימות": [
                    "חבירה למנהל הזירה ובידוד הזירה",
                    "סיוע למנהל הזירה בהתאם לצורך",
                    "הכוונת כוחות חילוץ בשער היישוב",
                    "השארת צירים פנויים מרכבים ומסקרנים",
                    "לאחר טיפול בזירה - להשאיר נציג שיוודא שאף אחד שלא מורשה לא ייכנס אליה"
                ]},
                color:"#00AAD1"
              },
              {
                role: "אוכלוסייה",
                id:3,
                  tasksByPhases: { "משימות": [
                    "יצירת תמונת מצב מודיעין אוכלוסייה - מי ביישוב, מי בעבודה ומי מנותק קשר",
                    "העברת נתוני אוכלוסייה למנהל זירה - מי בדיוק מתגורר במבנים שנפגעו",
                    "סיוע בהכוונת מתנדבי אד הוק (כולל בני נוער) סגירת מעגלים מול מנהל זירה על כמות תושבים בזירה ומציאת פערים (השוואת רשימות)",
                    "יצירת תכנית 'מענה משלים' קהילתי לשעות הקרובות ולימים הקרובים לאישור היו\"ר",
                    "סיוע נפשי לילדים ולנוער",
                    "הכנת צוות 'הודעה מרה' מהיישוב על כלל המשמעויות"
                ]},
                color:"#FF6D01"
      
              },
              {
                role: "לוגיסטיקה",
                id:4,
                tasksByPhases: { "משימות": [
                    "טיפול במפגעים - סגירת חשמל, מים וגז בזירה",
                    "אספקת אמצעי חילוץ - ג'קים, לומים, חבלים, שרשראות, טרקטורים ועוד",
                    "הערכות להארת הזירה בשעות החושך",
                    "סיוע שוטף במזון ושתייה למי שעובד בזירה"
                ]},
                color:"#FFA133"
      
              },
              {
                role: "מידע לציבור",
                id:5,
                  tasksByPhases: { "משימות": [
                    "פרסום ראשוני על הזירה כמה שיותר מהר",
                    "פרסום הנחייה להתרחקות סקרנים ומיקום ונציג קליטת מתנדבים",
                    "פרסום נפגעים כמה שיותר מהר (לאחר ההודעה המרה)",
                    "הודעות עדכון כל שעה על מצב החילוץ בזירה",
                    "הודעה על הפסקת החילוץ ופרסום הנחיות יו\"ר בהתאם",
                    "להצעות של מכלול אוכלוסייה על 'מענה משלים'"
                ]},
                color:"#9F2B68"
      
              },
              {
                role: "מנהל זירה ",
                id:6,
                  tasksByPhases: { "משימות": [
                    "סריקה ראשונית: תיחום הזירה העברת דיווח ליו\"ר צח\"י ובקשה לאמצעים/אנשים",
                    "הערכת זירה: מסוכנות, נפגעים, מבנים נוספים",
                    "חלוקת גזרות לצוותים והגדרת אחריות",
                    "ווידאו נטרול מפגעים - חשמל, גז, מים",
                    "הגדרת נתיבי כניסה ויציאה מהזירה",
                    "קביעת נקודות - פצועים, הרוגים, חרדה, פינוי פסולת",
                    "הגדרת אחראי על מודיעין אוכלוסייה בזירה שייצור תמונה 'דקה טרום האירוע' - מי היה בבית שנפגע וסינכרון עם תכניות המבנה (ממח' הנדסה של המועצה)",
                    "הכנסת כוחות חילוץ נוספים לזירה"
                ]},
                color:"#EA4335"
      
              },
        ]
      },
      
    {
      id:7,
      color:"#e06666",
      situation: "רעידת אדמה",
      description: " אסון טבע ברמה לאומית – ללא התראה/אזהרה.",
      notes: [
        "דרכי תקשורת משובשים – טלוויזיה, רדיו, סלולרי, טלפון וכו‘ – משמעויות התנהלות אחרת!",
        "פצועים, לכודים, מנותקי קשר",
        "פגיעה בתשתיות ואף מחוץ ליישוב – חשמל מים גז",
        "סיכון גבוה לשריפות",
        "רעידות משנה – סכנה לקריסות בתים נוספים",
        "רוב הניצולים יהיו בחילוץ עצמאי – שעות הראשונות של האירוע (אפילו עד 72 שעות)",
        "כמות גדולה של תושבים מחוסרי גג"
    ]
    ,
    roles:[
        {
        role: `יו"ר צח"י`,
        id: 1,
        tasksByPhases: {
          "אחרי רעידה ראשונה": [
            "  יצירת תמונת מצביישובית: אוכלוסיה ונזק לבתים ותשתיות",
            "הכוונת פעולות חילוץ בהתאם למודיעין אוכלוסייה(מיקומי לכודים)"
        ],
          "יממת הזהב ": [
          "בדיקה מחודשת לתיעדוף למאמצי החילוץ ולטיפול בתשתיות (מים תחילה)",
         "הערכות כללית להפסקות חשמל ומים ארוכות",
         "שליטה באוכלוסייה על ידי מודיעין ומידע לציבור",
         "היערכות לטיפול במחוסרי גג",
         "הודעות עדכון למועצה סיוע וטיפול למחוסרי"
        ]
        },
        color: "#22B573"
      },
      {
        role: "ביטחון",
        id: 2,
        tasksByPhases: {
    
            "אחרי רעידה ראשונה": [
              "יצירת תמונת מצב של זירות עם בתים שקרסו על ידי סריקה פיזית ביישוב",
              "סיוע במאמץ החילוץ לצוותי החילוץ"
            ],
            "יממת הזהב ": [
              "המשך סיוע במאמץ החילוץ לצוותי החילוץ",
              "בידוד וסימון בתים בסכנת קריסה",
              "בידוד וסימון אתרים מסכני חיים (חשמל, בורות וכו')"

            ]
          },
        color: "#00AAD1"
      },
      {
        role: "אוכלוסייה",
        id: 3,
        tasksByPhases: {
          "אחרי רעידה ראשונה":[
              "יצירת תמונת מצב מודיעין אוכלוסייה – מי ביישוב, מי בעבודה ומי מנותק קשר",
              "המלצה לתוכנית סיוע לאוכלוסייה חלשה",

            ],
         "יממת הזהב": [
              "טיפול בנפגעים בגוף ונפגעי חרדה",
              "הערכות לקליטת מתנדבים ספונטניים",
              "יצירת שמרטפייה למתנדבי צח\"י",
              "יצירת תכנית למידה אלטרנטיבית/העסקת נוער",
              "סיוע וטיפול למחוסרי גג"
          ]

          },
        color: "#FF6D01"
      },
      {
        role: "לוגיסטיקה",
        id: 4,
        tasksByPhases: {
          "אחרי רעידה ראשונה":[
            "מיפוי נזקי תשתיות – מים, חשמל, דרכי גישה",
            " טיפול בסיכונים בתשתיות שנפגעו – מים בעדיפות על הכל, חשמל, דרכי גישה בתוך היישוב ואליו"
        ],
      "יממת הזהב ": [
            "המשך עבודה על חידוש תשתיות",
            "הגדרת מבנים בסכנת קריסה",
            "סיוע לוגיסטי למחוסרי גג",
            "הערכות כללית להפסקות חשמל ומים ארוכות"
        ]
          },
        color: "#FFA133"
      },
      {
        role: "מידע לציבור",
        id: 5,
        tasksByPhases: {
          "אחרי רעידה ראשונה":[
           "פרסום הנחיות התנהגות בעת רעידות משנה וזיהוי עצמי של בתים שנפגעו ועלולים לקרוס",
           "ודעה לאוכלוסייה על מיקומים בהם נדרשות 'ידיים עובדות' ביישוב"
        ],
      "יממת הזהב": [
          "פרסום ריכוז מתקני קליטה וסיוע",
          "פרסום נהלי יישוב בחירום ודרכי תקשורת לחמ\"ל",
          "הודעה כל חצי יום עדכונים"
      ]

          },
        color: "#9F2B68"
      },
      {
        role: `צוותי חילוץ`,
        id: 6,
        tasksByPhases: {
        "אחרי רעידה ראשונה": [
          "עבודה על זירות הרס – כל מוכשר סע\"ר ינהל קבוצת מתנדבים במקום מגוריו בשעות הראשונות",
          "העברת תמונת מצב ליו\"ר צח\"י – מידת הרס, כמות לכודים, כמות מחלצים פועלים"
      ],

      "יממת הזהב ": [
            "סיוע ליישובים נוספים בהתאם להנחיות מועצה"
        ]
          },
        color: "#EA4335"
      }
    ],
    },
    




    {
      id:8,
      color:"#e06666",
      situation: "שריפה",
      description: "מצב חירום עקב שריפה בשטח.",
      notes: [
        "סכנת חיים מיידית - חייבת תגובה מהירה והחלטית",
        "פגיעה בתשתיות - חשמל, כבישים חסומים וכו..",
        "צורך בפינוי מיידי ולעיתים אילתורים בפינוי (כגון הליכה רגלית, הסעה ע\"ג קלאב קאר ועוד)",
        "טיפול מתמשך במפונים וטיפול פרטני באלה שביתם נשרף"
    ],
    roles:[
        {
        role: `יו"ר צח"י`,
        id: 1,
        tasksByPhases: {
          "בשגרה": [
            `קבלת הערכה מקב"ט המועצה על אינדקס. שריפות גבוהה ועדכון ראשי הצוותים בצח"י`
          ],
          "באירוע שריפה מוגבל (ללא היערכות לפינוי)": [
            "הגדרת ראש צוות כיבוי וצוותו",
            "יצירת תמ\"צ יישוב, עדכון המועצה וצח\"י",
            "הבנת מידת האיום והגדרת דחיפות להיערכות לפינוי או פינוי בפועל של שכונה/יישוב שלם"
        ],
          "לאחר הבנה/הנחייה על היערכות או ביצוע פינוי": [
            "הנחייה על בניית תכנית עבודה לפינוי ותיכלול כל הצוותים",
            "שליטה באוכלוסייה ע\"י מודיעין ומידע לציבור",
            "חבירה לכוחות חיצוניים וקבלת תמ\"צ רלוונטית",
            "דיווח למועצה/חפ\"ק שכלל התושבים פונו"
        ],
        "לאחר הפינוי":[
            "תיכלול מיפוי מקים פיסיים ולתושבים שאינם יכולים לחזור לבתיהם",
            "כתיבת תהליך חזרה לשגרה"
        ]
        },
        color: "#22B573"
      },
      {
        role: "ביטחון",
        id: 2,
        tasksByPhases: {
            "בשגרה": [
                "לקבוע רשימת צופי אש וסיורים בשטת מסביב לשעון",
                "הכנת ציוד יחד עם צוות הלוגיסטיקה"
            ],
            "באירוע שריפה מוגבל (ללא היערכות לפינוי)": [
                "הזעקת כוחות חירום כב\"ה, משטרה, מד\"א ו\"שדכן\" בשער היישוב להכוונה",
                "קבלת מודיעין אוכלוסייה לגבי תושבים בזירה",
                "סריקה בזירה לפי סדרי עדיפויות (בבית, בחו\"ל וכו)",
                "בידוד הזירה מסקרנים"
            ],
            "לאחר הבנה/הנחייה על היערכות או ביצוע פינוי": [
                "הוצאה לפועל של תכנית הפינוי",
                "הצבת מחסומים והכוונת התנועה",
                "עדכון שוטף של יו\"ר צח\"י ומכלול אוכלוסייה על התקדמות הסריקות"
            ],
          "לאחר הפינוי":[
            "שמירה על סדר ציבורי וחסימת אזורים בעלי סיכון התלקחות.",
            "מיפוי נזקים לבתי תושבים"
        ]
          },
        color: "#00AAD1"
      },
      {
        role: "אוכלוסייה",
        id: 3,
        tasksByPhases: {
            "בשגרה": [
                "ריענון רשימות תושבים במיוחד באזורים המועדים/בסיכון לשריפה"
            ],
            "באירוע שריפה מוגבל (ללא היערכות לפינוי)":[
                "יצירת תמונת מצב מודיעין אוכלוסייה - מי ביישוב ומי מנותק קשר בדגש על איזור השריפה",
                "המלצה לתוכנית סריקה לפי נתוני תמונת מצב אוכלוסייה",
                "טיפול בנפגעי חרדה - מפונים, באיזור השריפה"
            ],
            "לאחר הבנה/הנחייה על היערכות או ביצוע פינוי": [
                "ביצוע מעקב שמי על המפונים",
                "סיוע לנפגעי חרדה והגדרת טיפול ראשוני במפונים",
                "מעקב שמי אחר מפונים והעברת פערים (ליו\"ר וביטחון)"
            ],
          "לאחר הפינוי":[
            "מיפוי של תושבים שאינם יכולים לחזור לבתיהם",
            "ליווי וטיפול בנפגעי חרדה ואלה שביתם נשרף"
        ]
          },
        color: "#FF6D01"
      },
      {
        role: "לוגיסטיקה",
        id: 4,
        tasksByPhases: {
            "בשגרה": [
                "טיפול וסילוק מפגעים פוטנציאליים, מיפוי אזורי כיסוי הידראנטים, הכנת ציוד - נייד וזמין"
            ],
            "באירוע שריפה מוגבל (ללא היערכות לפינוי)": [
                "סילוק מפגעי תשתית מהזירה - חשמל, גז, רכבים וכו",
                "גיוס אמצעי הנדסה - כגון טרקטורים ליצירת חציצה",
                "מיפוי חומרים מסוכנים והמלצה לטיפול"
            ],
            "לאחר הבנה/הנחייה על היערכות או ביצוע פינוי": [
                "הכשרת דרכי כניסה ויציאה מהיישוב והמלצה על תוואי הפינוי למחלקת ביטחון",
                "סיוע באמצעי הובלה/הסעה של המפונים",
                "הקמה לוגיסטית של נקודת קליטה ופינוי פצועים"
            ],
          "לאחר הפינוי":[
            "סיוע לוגיסטי למפונים בנקודת הפינוי",
            "מיפוי נזקים לתשתיות החיוניות של היישוב"
        ]
          },
        color: "#FFA133"
      },
      {
        role: "מידע לציבור",
        id: 5,
        tasksByPhases: {
            "בשגרה": [
                "ריענון הודעות נצורות: למקרה שריפה, היערכות לפינוי ופינוי"
            ],
            "באירוע שריפה מוגבל (ללא היערכות לפינוי)": [
                "הודעה מוכנה מראש על מיקום השריפה והנחיות ראשוניות",
                "הוצאת הנחיות משטרה וכב\"ה",
                "הודעות שוטפות על התקדמות האירוע ומתי יצא העדכון הבא"
            ],
            "לאחר הבנה/הנחייה על היערכות או ביצוע פינוי":[
                "הודעה על היערכות לפינוי או פינוי בפועל",
                "הודעות על: מסלול הפינוי ופתיחת נקודת קליטת מפונים"
            ],
          "לאחר הפינוי":[
            "הודעות על המשך הטיפול בשריפה ובמפונים",
            "עדכון על סיום הפינוי וצעדיפ הבאים"
        ]
          },
        color: "#9F2B68",
        messages:["עקב מזג אויר יבש וחם בימים הקרובים / בתאריכים ___ אסורה הדלקת מדורות. יש לשמור על ערנות ולדווח על כל אירוע חריג.",
          "שריפה [במיקום] בטיפול צוות הצח”י אשר נמצא במקום. צוותי כיבוי אש בדרך. מתבקשים להימנע מלהגיע לאזור ולשמור על הדרכים פנויות.",
          "השריפה בטיפול כוחות הכיבוי וצוות הצח”י ונמצאת בשליטה. עקב התפשטות עשן מתבקשים להיכנס לבתים ולסגור את החלונות.",
          "השריפה בשליטה של כוחות הכיבוי / כובתה. ניתן לחזור לשגרה. אפשר לצאת מהבתים. התושבים מתבקשים לא להגיע לאזור השריפה.",
          "עקב התפשטות השריפה קיימת סכנה מיידית לתושבים בשכונת ]שם השכונה[. התושבים מתבקשים להתפנות באופן מיידי מהבתים אל נקודת הרישום ולדווח האם מתפנים למקום עצמאי או לנקודת הפינוי המסודרת היישובית. ב ]מיקום נקודת הפינוי ביישוב[, מי שזקוק לסיוע יש ליצור קשר מיידי בטלפון [מספר טלפון]. שאר התושבים מתבקשים להישאר בבתים ולסגור את החלונות. אין להסתובב בחוץ על מנת להימנע משאיפת עשן והפרעה לכוחות הבטחון.",
          "עקב התפשטות השריפה קיימת סכנה מיידית של הגעת האש לבתים כוחות הביטחון הורו על פינוי מיידי של היישוב. התושבים מתבקשים להתפנות באופן מיידי מהבתים לנקודת הרישום ולדווח האם מתפנים למקום עצמאי או לנקודת פינוי היישובית המסודרת. ב- בפינוי עצמאי יש לדווח בהודעה לטלפון מספר ]מספר טלפון[. מי שזקוק לסיוע יש ליצור קשר מיידי בטלפון ]מספר טלפון[. אין להסתובב בחוץ על מנת להימנע משאיפת עשן והפרעה לכוחות הבטחון. לגבי אירוע חומרים מסוכנים - ראה פרק נפרד בפנקס זה."
        ]
      },
      {
        role: `צוות כיבוי בזירה `,
        id: 6,
        tasksByPhases: {
            "בשגרה": [
                "ביצוע אימון \"רטוב\" של הצוות על כלל הציודים"
            ],
            "באירוע שריפה מוגבל (ללא היערכות לפינוי)": [
                "הגדרת תיחום האירוע וביצוע פעולות כיבוי בזירה ע\"ב הידראנטים, מטפים, מחבטי אש וכו'",
                "אבחנה במימדי האיום - בהתאם לרוח, אמצעי הובלה ומזג אוויר",
                "בידוד הזירה - בלוני גז, חשמל, רכבים וכו'",
                "דיווח ליו\"ר צח\"י כל 10 דק' לפחות."
            ],
            "לאחר הבנה/הנחייה על היערכות או ביצוע פינוי": [
                "המשך לחימה באש, תוך דגש על עיכוב התקדמות. האש לנתיב הפינוי המתוכנן"
            ],
          "לאחר הפינוי":[
            "מנוחה וחידוש הציוד",
            "מוכנות מלאה לתת מענה למקרה התלקחות מחודשת."
        ]
          },
        color: "#EA4335"
      }
    ],
    },
    {
      id: 9,
      color:"#e06666",
      situation: `פגיעה בתשתיות חיוניות`,
      description: "מצב בו נפגעות תשתיות מים , חשמל ותקושרת",
      notes:  [
        "השיבושים יכולים להימשך מספר ימים, ייתכן גם ברציפות.",
        "בהחזרת חשמל לפרקי זמן קצרים יש לנצל לטעינת סלולר/רדיו/אמצעים קריטיים.",
        "הפסקת אספקת מים עלולה להיות קריטית לאוכלוסיות שונות וחייבת לקבל מענה מיידי.",
        "יש להקפיד על שימוש מושכל וחסכוני מאוד.",
        "פגיעה ברוב האוכלוסייה וסכנת חיים עבור בודדים שנדרשים למכשירי מצילי חיים המחוברים לחשמל.",
        "שיבושים משמעותיים המייצרים לחץ ומעלים את רמת החרדה.",
        "הנחיה לציבור (ראה הודעות נצורות) לחיסכון במים וצריכת חשמל.",
        "מתן מענה מציל חיים לאוכלוסיות נזקקות ותמיכה באוכלוסיות חלשות.",
        "הפצת מידע בנתק תקשורת על ידי אמצעים פיזיים (כריזה, פליירים, לוח מודעות) ופתיחת מוקד מידע פיזי.",
        "חלוקת מים יחד עם פרסום מקומות בהן ניתן להשיג מים גם מחוץ ליישוב."
      ],
    roles:[
      {
      role: `יו"ר צח"י`,
      id: 1,
      tasksByPhases: {
        "בשגרה": [
          "הכרת תרחיש הייחוס והכנת המענה היישוב"
        ],
        "תגובה מיידית": [
          "הבנת חומרת הפגיעה – מקומי (רמת היישוב/מועצה) או ברמת המדינה. לבדוק עם המועצה הערכות להחמרה בהתאם להערכת המצב",
       
      ],
      "טיפול מתמשך":[
          "ניהול הערכות מצב שוטפות וקבלת החלטות – צפי להמשך, תמונת מצב אוכלוסייה, מצב תשתיות חשמל ומים ביישוב",
          "תעדוף משאבים עם מתן תעדוף לאוכלוסייה נזקקת. ביצוע תכנית חלוקת מים בעת הצורך"
      ]
      },
      color: "#22B573"
    },
    {
      role: "ביטחון",
      id: 2,
      tasksByPhases: {
        "בשגרה": [
          "הכרת תשתיות חיוניות – נתיבי אספקה ומבנים קריטיים (ממסר/משאבות), הכנת אמצעי קשר פנימיים וחיצוניים"
        ],
        "תגובה מיידית": [
          "סיוע ללוגיסטיקה בטיפול בתקלה (אם מקומית)"
      ],
     "טיפול מתמשך": [
        "שמירה על ביטחון היישוב: אבטחה, ליווי וסיוע לפעולות הצח\"י, קשר עם כוחות ההצלה"
      ]

        },
      color: "#00AAD1"
    },
    {
      role: "אוכלוסייה",
      id: 3,
      tasksByPhases: {
        "בשגרה": [
          "הגדרה ועדכון עיתי של רשימות אנשים בסכנת חיים בהפסקת חשמל/מים. אפיון הצורך והמענה לנתק תקשורת"
        ],
        "תגובה מיידית": [
          "רשימת אנשים שיימצאו בסכנת חיים מיידית עקב מחסור במים / חשמל"

      ],
      "טיפול מתמשך":[
      "מענה הולם לאוכלוסיה נזקקת בהיבטי מזון ואנרגיה, יצירת תמונת מצב אוכלוסייה ומתן מענים בהתאם לצרכים משתנים"

      ]
        },
      color: "#FF6D01"
    },
    {
      role: "לוגיסטיקה",
      id: 4,
      tasksByPhases: {
        "בשגרה": [
          " הכרת תשתיות חיוניות - נתיבי אספקה ומבנים קריטיים (ממסר/משאבות)",
          " הכנת תכנית חלוקת מים יחד עם מכלול אוכלוסייה"

        ],
        "תגובה מיידית": [
         " הבנה באיזה סוג פגיעה מדובר – האם מקומי (רמת היישוב/מועצה) או ברמת המדינה.",
          " מענה לרשימת סכנת חיים מיידית.",
          " הערכות ויצירת קשר עם המועצה לחלוקת מים."

      ],
      "טיפול מתמשך":[
        " ניהול ובקרת תשתיות עצמאיות של חשמל ומים. הוצאה לפועל של תכנית חלוקת מים."

      ]
        },
      color: "#FFA133"
    },
    {
      role: "מידע לציבור",
      id: 5,
      tasksByPhases: {
        "בשגרה": [
          " הכנת הודעות נצורות למקרה הצורך. הגדרת דרכי תקשורת חלופיים להפצת מידע בנתק תקשורת."

        ],
        "תגובה מיידית": [
         "עדכון היישוב שישנה בעיה ויועברו עדכונים בהקדם, הנחיה על חסכון מלא במים, סגירת השקיית גינות וכד‘. ברוב הבתים יש מים בדוד שמש / חשמל הנחיה על שימוש מושכל בסוללות טלפונים. הנחיות למצב נתק תקשורת."

      ],
      "טיפול מתמשך": [
    "עדכון שוטף לציבור – מצב תשתיות, הנחיות חסכון במים / חשמל, אפשרויות לקבלת סיוע.",
    "הצטיידות במזון ומים, דרכי קשר לצח\"י.",
    "פרסום נקודות חלוקה ושעות חלוקת המים."
]

        },
      color: "#9F2B68"
    },
    {
      role: `הנהלת הישוב`,
      id: 6,
      tasksByPhases: {
        "בשגרה": [
        "תחזוקת תשתיות מים, חשמל ותקשורת עצמאיות קיימות"

        ],
        "תגובה מיידית": [
         "ניהול היישוב ותפעול תשתיות"

      ]
        },
      color: "#934e2b"
    }
  ],
    },
    {
      id: 10,
      color:"#e06666",
      situation: `מזג אוויר קיצוני`,
      description: "מצב שקורה כאשר יש עומס חום קיצוני או קור קיצוני והצפות ",
      notes: [
        "בשנים האחרונות מזג האויר נהיה קיצוני – מחד יותר חם ויבש בקיץ כולל בעונות מעבר",
        "ומאידך כמויות משקעים רבות בפרק זמן קצר מאד וצניחת טמפ‘ בחודשי החורף.",
        "נפגעים עיקריים ממז“א קיצוני )קור/חום(– תינוקות, קשישים, אוכלוסיות מועדות אחרות הרגישות לקור/חום",
        "ונזזקקות לאספקת חשמל ומים רציפה לקיום החיים.",
        "סיוע הדדי בין כלל התושבים הינו קריטי ויצטרך להיות מוכוון ע“י הצח“י )מכלול אוכלוסייה( לאוכלוסיות",
        "שאינן יכולות להסתדר בכוחות עצמם",
        "יכולת חיזוי מרשימה שמייצרת התראות מספר ימים לפני גלי קור/חום – יש זמן להיערכות"
    ],
    roles:[
      {
      role: `יו"ר צח"י`,
      id: 1,
      tasksByPhases: {
        "בשגרה": [
            "הכנת תכנית מגירה של הצח\"י עם הנהגת היישוב וביצוע תרגול שולחני יזום בשני התרחישים – חום וקור"
        ],
        " בקבלת התראה על מז\"א קיצוני": [
          "גזירת המשמעויות לגבי לימודים ואוכלוסיות מועדות לפגיעה"
      ],
        "באירוע": [
          "יש לפעול בהתאם לאירוע פגיעה בתשתיות או פינוי בית ספר"
      ],
      "לאחר האירוע":[
          "בקרת נזמים וטיפול בהם, היערכות לאירועים דומים תוך זמן קצר"
      ]
      },
      color: "#22B573"
    },
    {
      role: "ביטחון",
      id: 2,
      tasksByPhases: {
        "בשגרה": [
          "הכנת תכנית מגירה של הצח\"י עם הנהגת היישוב וביצוע תרגול שולחני יזום בשני התרחישים – חום וקור"
      ],
        " בקבלת התראה על מז\"א קיצוני": [
           "בהתאם להנחיית יו\"ר, ביצוע מלא/חלקי של מעבר משגרה לחירום"
      ],
         "באירוע": [
            "יש לפעול בהתאם לאירוע פגיעה בתשתיות או פינוי בית ספר"
          ],
        "לאחר האירוע":[
        "בקרת נזמים וטיפול בהם, היערכות לאירועים דומים תוך זמן קצר"
      ]
        },
      color: "#00AAD1"
    },
    {
      role: "אוכלוסייה",
      id: 3,
      tasksByPhases: {
          "בשגרה": [
            "הכנת תכנית מגירה של הצח\"י עם הנהגת היישוב וביצוע תרגול שולחני יזום בשני התרחישים – חום וקור",
            "הגדרה ועדכון עיתי של רשימות אנשים בסכנת חיים בהפסקת חשמל/מים ובעיות בריאות - קשיי נשימה"


          ],
          " בקבלת התראה על מז\"א קיצוני":[
             "יצירת מיפוי עדכני של אוכלוסיות מועדות לפגיעה ממז\"א קיצוני, משמעויות לגבי לימודים והפעלת 'למידה מרחוק' ו/או מערכת חינוך בלתי פורמאלית"
          ],
          "באירוע": [
             "יש לפעול בהתאם לאירוע פגיעה בתשתיות או פינוי בית ספר"
          ],
        "לאחר האירוע":[
          "בקרת נזמים וטיפול בהם, היערכות לאירועים דומים תוך זמן קצר"
      ]
        },
      color: "#FF6D01"
    },
    {
      role: "לוגיסטיקה",
      id: 4,
      tasksByPhases: {
        "בשגרה": [
          "הכנת תכנית מגירה של הצח\"י עם הנהגת היישוב וביצוע תרגול שולחני יזום בשני התרחישים – חום וקור"
      ],
      " בקבלת התראה על מז\"א קיצוני": [
             "ניקיון של פתחי ניקוז מועדים לסתימה, גיזום עצים"
          ],
          "באירוע": [
           "יש לפעול בהתאם לאירוע פגיעה בתשתיות או פינוי בית ספר"
          ],
        "לאחר האירוע":[
        "בקרת נזמים וטיפול בהם, היערכות לאירועים דומים תוך זמן קצר"
      ]
        },
      color: "#FFA133"
    },
    {
      role: "מידע לציבור",
      id: 5,
      tasksByPhases: {
          "בשגרה": [
            "הכנת תכנית מגירה של הצח\"י עם הנהגת היישוב וביצוע תרגול שולחני יזום בשני התרחישים – חום וקור",
            "הכנת הודעות נצורות למקרה הצורך"
          ],
          " בקבלת התראה על מז\"א קיצוני": [
            "פרסום הנחיות מועצה והמלצות להצטיידות בהתאם"
          ],
          "באירוע":[
            "יש לפעול בהתאם לאירוע פגיעה בתשתיות או פינוי בית ספר"
          ],
        "לאחר האירוע":[
        "בקרת נזמים וטיפול בהם, היערכות לאירועים דומים תוך זמן קצר"
      ]
        },
      color: "#9F2B68"
    },
    {
      role: `הנהלת הישוב`,
      id: 6,
      tasksByPhases: {
          "בשגרה": [
            "הכנת תכנית מגירה של הצח\"י עם הנהגת היישוב וביצוע תרגול שולחני יזום בשני התרחישים – חום וקור",
            "לקראת חורף – הכנת תשתיות, ניקיון פתחי ניקוז וגיזום עצים שעלולים לקרוס על בתים וקווי חשמל"
          ],
          " בקבלת התראה על מז\"א קיצוני": [
              "הגדרת קבלני תשתיות, ווידוא ציוד פינוי מוכנות ובכוננות בהתאם, הגדרת כוננים"
          ],
          "באירוע": [
             "יש לפעול בהתאם לאירוע פגיעה בתשתיות או פינוי בית ספר"
          ],
        "לאחר האירוע":[
         "בקרת נזמים וטיפול בהם, היערכות לאירועים דומים תוך זמן קצר"
      ]
        },
      color: "#934e2b"
    }
  ],
      
    },
    {
      id: 11,
      color:"#e06666",
      situation: `חומר מסוכן`,
      description: "מצב שקורה כאשר יש עומס חום קיצוני או קור קיצוני והצפות ",
      notes: [
        "מחייב תגובה מיידית ומוגבלת – אסורה כניסה לאזור ללא מיגון מתאים",
        "חומר מסוכן קיים בכל מקום – בריכות, גז ביתי, אמצעי קירור, מפעלים סמוכים, משאיות מובילים",
        "הסתגרות מיידית באזור הסיכון )סגירת חלונות ודלתות וכד’(– בהתאם להנחיות משטרה וכב”ה.",
        "חומר מסוכן מתנדף בהתאם למזג אוויר )ברום שמסוכן גם הוא אך אינו מתנדף ונשאר בזירת האירוע – לא נדון כאן(",
        "אחריות על הנחיות – משטרה דרך המועצה או ישירות"
      ],
    roles:[
      {
      role: `יו"ר צח"י`,
      id: 1,
      tasks: 
      ["הוצאת הודעה לכלל התושבים על האירוע: הוראות מיגון – חדר פנימי סגור עם סמרטוט רטוב על הפתחים.", "זיהוי אזור/אוכלוסייה בסכנה ואופן טיפול.",
         "הגדרת מקום פינוי לאוכלוסייה בסכנה במידת האפשר.","פעולה גם ללא הנחייה של מועצה / משטרה."     ]
      ,
      color: "#22B573"
    },
    {
      role: "ביטחון",
      id: 2,
        tasksByPhases: { "משימות": [
         "הערכת התפשטות החומר בהתאם למזג האויר.","חסימת צירי גישה לתושבים לאזור הנפגע.",
         "מציאת צירים לאוכלוסייה בסכנה והמלצה ליו”ר.","הוצאת אוכלוסייה בסכנה )לאחר הנחייה מיו”ר(."
      ]},
        
      color: "#00AAD1"
    },
    {
      role: "אוכלוסייה",
      id: 3,
        tasksByPhases: { "משימות": [
         "יצירת מודיעין אוכלוסייה לפי מוקד האירוע – מי בזירה ומי בסכנת פגיעה בטווח הזמן הקרוב.",
          "מציאת גורמים קולטים לאוכלוסייה בסכנה – פנים יישובים ואם צריך מועצתי.",
           "יצירת תמונת מצב מפונים / נקלטים.",
           "יצירת מענה משלים לאוכלוסייה מפונה."
          ]},
      color: "#FF6D01"
    },
    {
      role: "לוגיסטיקה",
      id: 4,
        tasksByPhases: { "משימות": [
          "שינוע אמצעים לפינוי.",
          "ארגון לוגיסטי של מרכז הקליטה.",
          "יצירת נתיבים חלופיים לפינוי במידת הצורך."
      ]},
      color: "#FFA133"
    },
    {
      role: "מידע לציבור",
      id: 5,
        tasksByPhases: { "משימות": [
       "הוצאת הודעה הסתגרות עם סמרטוט רטוב על פתחים בחדר סגור.",
       "הוצאת הודעות עדכון על מפונים ולאן.",
       "שליטה ומידע למתקשרים על מיקום המפונים.",
        "עדכון על סיום האירוע."
    ]},
      color: "#9F2B68"
    },
    {
      role: `הנהלת הישוב`,
      id: 6,
        tasksByPhases: { "משימות": [
        "העמדת אמצעי היישוב לרשות הצח”י.",
        "שילוב בחשיבת ליצירת מודיעין אוכלוסייה.",
        "סיוע במציאת פתרון למקום לפינוי."
     ]},
      color: "#934e2b"
    }
  ],
      
    },
    
  
  ];
  
  export default emergencyScenarios;