const emergencyScenarios = [
    {
        id: 1,
        color:"#30ba8e",
        situation: `שגרה`,
        description: "מצב של הכנה למלחמה או איומים ביטחוניים.",
        notes: [
          "ניצול 'זמן יקר' וצמצום זמן התגובה הראשונית",
          "ארגון תמונת מצב אוכלוסיה (מתעדכנת)",
          "בדיקת ציוד ותשתיות והכנתם לשימוש מיידי",
          "מעבר מהיר לאירועי חירום",
          `ראשי צוותי מעדכנים את היו"ר על מצב המוכנות של הצוות שלהם - איוש, ציוד, משמרות, זמינות, המלצות להמשך`
      ],
        roles: [
          {
            role: `יו"ר צח"י`,
            id: 1,
            tasksByPhases: {
                "הקמת הצוותים על ידי צוות מוביל ועדכון רשימות ודרכי תקשורת":[
                    `לאחר הקמת הצוות והדרכה ראשונית, בניית תיק צח"י ישובי, עמוד 95-100 בתיק צח"י`
                ],
                "הכשרה הדרכה ותרגול נוהלי הפעלה":[
                  "פיתוח ושימור הצוות ",
                  "מיפוי חוזקות וחולשות",
                  "ביצוע ביקורת ציוד ורשימת אנשים/ציוד לראשי הצוותים אחת לחצי שנה"
                ]
            },
            color: "#22b574ff"
        },
        
        
            {
              role: "ביטחון",
              id:2,
              tasksByPhases: { "הקמת הצוותים על ידי צוות מוביל ועדכון רשימות ודרכי תקשורת": [
                `עדכון רשימות אנשים וציוד ריענון ובדיקה אחת לחצי שנה  עמוד 119 בתיק צח"י`
              ],
              "הכשרה הדרכה ותרגול נוהלי הפעלה":[
                " הגדרת נהלים לביצוע בשטח,   תוכניות כוננות,",
                "הגדרת תפקידים והכרת השטח",
                `תיאום ושילוב צח"י בתרגילי המשטרה והצבא, השתלמויות, מקצועיות`

              ]


            },
              color:"#00AAD1"
            },
            {
              role:"רווחה",
              id:3,
              tasksByPhases: { "הקמת הצוותים על ידי צוות מוביל ועדכון רשימות ודרכי תקשורת": [
                `עדכון רשימות אנשים וציוד רענון ובדיקה אחת לחצי שנה ומיפוי או"ם עמוד 120-124 בתיק צח"י`
              ],
              "הכשרה הדרכה ותרגול נוהלי הפעלה":[
                "הכרת אוכלוסיה מבוגרת/חולה",
                "נגישות לאוכלוסיה סיעודית",
               `ריכוז מידע ונתונים לגבי מתנדבים וגורמי סיוע-רגשי/כלכלי לאוכלוסיות הנזקקות`

              ]


            },
              color:"#ff984aff"
    
            },
            {
              role: "לוגיסטיקה",
              id:4,
              tasksByPhases: { "הקמת הצוותים על ידי צוות מוביל ועדכון רשימות ודרכי תקשורת": [
               `עדכון רשימות אנשים וציוד רענון ובדיקה אחת  לחצי שנה עמוד 128-9 בתיק צח"י`
              ],
              "הכשרה הדרכה ותרגול נוהלי הפעלה":[
                "הכרת תשתיות השטח למקרי חירום, מלאי תקין",
                "גיבוש רשימה של בעלי מקצוע,קבלנים, ספקים",
              `ביצוע ביקורת ציוד ורשימת אנשים/בעלי הכשרה בתחזוקה ותיקונים/ציוד אחת לחצי שנה`

              ]


            },
              color:"#FFA133"
    
            },
            {
              role: "מידע לציבור",
              id:5,
              tasksByPhases:{ "הקמת הצוותים על ידי צוות מוביל ועדכון רשימות ודרכי תקשורת": [
                  `עדכון רשימות אנשים ובדיקה אחת לחצי שנה, רענון  עמוד 118 בתיק צח"י`
              ],
               "הכשרה הדרכה ותרגול נוהלי הפעלה":[
            "הכנת רשימת מומחים לצורכי הסברה בחירום",
                 "העברת הודעות והנחיות, ויצירת קשר במהירות",
               `הכרת והכנת אמצעי תקשורת מקומיים (פייסבוק ווצאפ) להפצת הודעות ומסרים`
               ]
 
 
             },
              color:"#9f4868ff"
    
            },
            {
              role: 'רפואה',
              id:6,
              tasksByPhases: { "הקמת הצוותים על ידי צוות מוביל ועדכון רשימות ודרכי תקשורת": [
                  `עדכון רשימות אנשים וציוד ריענון ובדיקה אחת לחצי שנה עמוד 126-7 בתיק צח"י`              ],
             "הכשרה הדרכה ותרגול נוהלי הפעלה":[
         "חוסר בציוד מסוים,ציוד רפואי מתקדם",
          "הגדרת תפקידים וציוד רפואי נדרש",
        `השתתפות בהדרכות מקצועיות של גורמי הבריאות במועצה`             ]


           },
           color:"#8f6a45ff"
          },
            {
              role: 'חינוך',
              id:7,
              tasksByPhases: { "הקמת הצוותים על ידי צוות מוביל ועדכון רשימות ודרכי תקשורת": [
                  `עדכון רשימות אנשי חינוך ודרכי תקשורת אחת לחצי שנה עמוד 125 בתיק צח"י`              ],
             "הכשרה הדרכה ותרגול נוהלי הפעלה":[
        "חינוך מיוחד, ילדים עם מוגבלויות ",
          "מרחבים מוגנים בסביבת בתי הספר והגנים",
       "השתתפות בהדרכות מקצועיות של גורמי החינוך במועצה"    ]


           },
              color:"#1a6da9ff"
            },
          
        ]
      },
    {
        id: 2,
        color:"#ffa133",
        situation: `מעמ"ל`,
        description: "מצב של הכנה למלחמה או איומים ביטחוניים.",
        notes: [
          "ניצול 'זמן יקר' וצמצום זמן התגובה הראשונית",
          "ארגון תמונת מצב אוכלוסיה (מתעדכנת)",
          "בדיקת ציוד ותשתיות והכנתם לשימוש מיידי",
          "מעבר מהיר לאירועי חירום",
          `ראשי צוותי מעדכנים את היו"ר על מצב המוכנות של הצוות שלהם - איוש, ציוד, משמרות, זמינות, המלצות להמשך`
      ],
      roles: [
        {
          role: `יו"ר צח"י`,
          id: 1,
          tasksByPhases: {
              "לפני האירוע":[
                  `קבלת עדכון תמונת מצב מדינה/גזרה מהמועצה`,
                  `וידוא יצירת מודיעין
אוכלוסיה תושבים/אורחים`
              ],
             
              "במהלך האירוע":[
                `הפעלת משמרות 24/7
בחמ"ל הצח"י והגדרת נהלי
התכנסות`,
               `
שליטה באוכלוסייה ע"י
 מידע לציבור`,
              ],
              "שגרת חירום":[
                `העברת עדכון חצי יומי / יומי
למועצה`,
               `תאום מועד ומקום לכינוס הצוות`
              ]
          },
          color: "#22b574ff"
      },
      
      
          {
            role: "ביטחון",
            id:2,
            tasksByPhases: {
              "לפני האירוע":[
                  `בדיקת זמינות אנשי הצוות`,
                  `בדיקת תקינות ציוד -
עגלות קיימות
פתיחת מקלטים ווידוא תקינותם, יצירת קשר עם גורמי הבטחון המרחביים- משטרה/ צבא ווידוא דרכי תקשורת`
              ],
              "במהלך האירוע":[
              `איגום משאבי חילוץ וכיבוי
- ג'קים, לומים בולי עץ`,
               
`בדיקת תקינות צירי תנועה
וצירים חלופיים`,
`מוודא על פי הנחיית המש"ק הביטחוני.רבש"צ או קב"ט המועצה את פעילותן של מערכות אעזקה וכריזה , את פתיחתם של מקלטים וממד"ים ציבורים ותקינותם.`
              ],
              "שגרת חירום":[
                `הגדרת שדכנים בשער
היישוב למקרה אירועים
`,
              `עדכון יו"ר צח"י על המצב והמוכנות`
              ]
          },
            color:"#00AAD1"
          },
          {
            role:"רווחה",
            id:3,
            tasksByPhases: {
              "לפני האירוע":[
                  `בדיקת זמינות אנשי הצוות`,
                 `יצירת תמונת מצב מודיעין
אוכלוסייה: מי ביישוב, בעבודה, בחו"ל ומי מנותק
קשר`
              ],
              "במהלך האירוע":[
              `יצירת תמונת מצב אורחים
(כולל מפונים/מתפנים)-
מי נקלט ביישוב
`,
               
`בירור לגבי אוכלוסייה
חלשה/נפגעי חרדה (גם.
בשקט), זקוקים לסיוע
צמוד (רפואי/נפשי)`,
              ],
              "שגרת חירום":[
             `יצירת מענה תומך
למשפחות בהן אחד
ההורים במילואים/ חו"ל`,
             `עדכון יו"ר צח"י על המצב והמוכנות`
              ]
          },
            color:"#ff984aff"
  
          },
          {
            role: "לוגיסטיקה",
            id:4,
            tasksByPhases: {
              "לפני האירוע":[
                  `בדיקת זמינות אנשי הצוות`,
                `בדיקת ציוד לוגיסטי וזמינותו
- טרקטורים, כלל אמצעי
כיבוי, אמצעי חשמל, גז,
תאורה`
              ],
              "במהלך האירוע":[
              `הכשרת דרכי כניסה ויציאה
מהיישוב והמלצה על התוואי
לביטחון של הצח"י`,
               
`מיפוי חומרים מסוכנים
והמלצה לטיפול במידת
הצורך`,
              ],
              "שגרת חירום":[
           `יצירת רשימה ליו"ר - ציוד
לוגיסטי זמין`,
            `עדכון יו"ר צח"י על המצב והמוכנות`
              ]
          },
            color:"#FFA133"
  
          },
          {
            role: "מידע לציבור",
            id:5,
            tasksByPhases: {
              "לפני האירוע":[
                  `בדיקת זמינות אנשי הצוות`,
               `הוצאת הודעה על שגרת.
היישוב - הודעה פעם
בחצי יום או פעם ביממה`
              ],
              "במהלך האירוע":[
             `מעבר על הודעות נצורות
רלוונטיות לתרחיש החירום
(מלחמה, שריפה וכו')
`,`הודעה על טלפון חרום של
מרכז מידע לציבור (לא
החמ"ל!).`,
              ],
              "שגרת חירום":[
          `ווידאו תקינות קו הטלפון
של מרכז פניות תושבים
`,
           `עדכון יו"ר צח"י על המצב והמוכנות`
              ]
          },
            color:"#9f4868ff"
  
          },
          {
            role: 'רפואה',
            id:6,
            tasksByPhases: {
              "לפני האירוע":[
                  `בדיקת זמינות אנשי הצוות`,
`הכרת נהלי חירום והפעלת הצוות, וידוא ציוד רפואי תקין`              ],
         
          },
            color:"#8f6a45ff"
          },
          {
            role: 'חינוך',
            id:7,
           tasksByPhases: {
              "לפני האירוע":[
                  `בדיקת זמינות אנשי הצוות`,
              `שמירה על קשר עם מוסדות החינוך `
              ],
              "במהלך האירוע":[
             `בדיקה הימצאות כלל התלמידים וקרבתם למרחב המוגן
`,`תיאום תמיכה וטיפול רגשי בילדים במעגלי פגיעות באמצעות מטפלים מקצועיים`,
              ],
              "שגרת חירום":[
          `אירגון והכנה של תוכניות הפעלה לילדים במקרה של היעדר לימודים`,
           `עדכון יו"ר צח"י על המצב והמוכנות`
              ]
          },
            color:"#1a6da9ff"
          },
          {
            role: 'חמ"ל',
            id:8,
           tasksByPhases: {
              "לפני האירוע":[
                  `בדיקת זמינות אנשי הצוות`,
              `שמירה על קשר עם מוסדות החינוך `
              ],
              "במהלך האירוע":[
             `בדיקה הימצאות כלל התלמידים וקרבתם למרחב המוגן
`,`תיאום תמיכה וטיפול רגשי בילדים במעגלי פגיעות באמצעות מטפלים מקצועיים`,
              ],
              "שגרת חירום":[
          `אירגון והכנה של תוכניות הפעלה לילדים במקרה של היעדר לימודים`,
           `עדכון יו"ר צח"י על המצב והמוכנות`
              ]
          },
          color:"#e8535f"
        },
        
      ]
    
      },
  
   
    {
      id: 3,
      color:"#e06666",
      situation: "מלחמה",
      description: "מצב חירום עקב התקפה צבאית.",
      notes: [
        "שעות ראשונות/ ימים ראשונים מורכבים במיוחד - נזק לתשתיות ומורל",
        "ירוע מתמשך למשך מספר שבועות - נפגעי חרדה, הפסקות לימודים - שיבוש שגרה",
        "חוסן היישוב מושפע ישירות מהיכולת לקיים שגרת חיים",
        "תמיכה למשפחות של מגוייסים - בשירות חובה ומילואים",
        "קליטה ספונטנית וקליטה מסודרת של תושבים מאזורי הלחימה",
        "סבירות גבוהה להפסקות חשמל/מים ממושכות",
        "היערכות לנפילות טילים שמחוללים: שריפות, אתרי הרס, נפגעים, חרדות, נזק לתשתיות"
        ],
        roles: [
          {
            role: `יו"ר צח"י`,
            id: 1,
            tasksByPhases: {
                "לפני האירוע":[
                    `קבלת הנחיות
התגוננות פקע"ר
מהמועצה והבנת
המשמעויות בדגש על
לימודים`
                ],
               
                "במהלך האירוע":[
                  `הגדרת שגרת חירום
לצח"י וליישוב יחד עם
הנהלת היישוב
`,
                `לפעול לעיבוי מתנדבי
צח"י בכל הצוותים
ע"ב מתנדבים חדשים
`,
`
עבודה עם מנהל
קהילה על יצירת מענה
קהילתי ולו"ז קבוע של
שגרת חירום של היישוב`
                ],
                "שגרת חירום":[
               `היערכות לקליטת
אוכלוסייה - בדגש
על "לעזור להם לעזור
לעצמם"
`,
                 `היערכות לקליטת
מתנדבים בודדים/
אירגונים
`
                ]
            },
            color: "#22b574ff"
        },
        
        
            {
              role: "ביטחון",
              id:2,
              tasksByPhases: {
                "לפני האירוע":[
                   `קבלת עדכונים יומיים מקב"ט המועצה`
                   
                ],
                "במהלך האירוע":[
                `אזעקת הצוות וגורמים רלוונטים הערכת מצב ראשונית`,
                `חבירה לגורמי סיוע בידוד האיזור שנפגע`,
                `פינוי אוכלוסיה    הרחקת קהל (צמצום סיכונים)  `,
                `מיפוי וסיוע לטיפול ראשוני בנפגעים ומשפחותיהם,`
                ],
                "שגרת חירום":[
                  `מוודא נהלי קליטה ובטיחון וקיומם, ודרכי יצירת קשר עם גורמי חירום,`
                ]
            },
              color:"#00AAD1"
            },
            {
              role:"רווחה",
              id:3,
              tasksByPhases: {
                "לפני האירוע":[
                    `המלצה לתוכנית סיוע.
לאוכלוסייה חלשה

ביצוע קשר לאוכלוסיות.
ולמוסדות מיוחדים
ביישוב`
                ],
                "במהלך האירוע":[
               `תמיכה למשפחות המגוייסים חובה ומילואים, והיערכות לקליטת מפונים`,
                 
 `היערכות לנפגעי חרדה וטראומה על ידי גורמי מקצוע`,
                ],
                "שגרת חירום":[
               `סיוע מקצועי לקליטת
האורחים
`,
               `יצירת שמרטפייה
למתנדבי צח"י
`
                ]
            },
              color:"#ff984aff"
    
            },
            {
              role: "לוגיסטיקה",
              id:4,
              tasksByPhases: {
                "לפני האירוע":[
                    `היערכות לנפילות טילים \ זירות הרס
`,
                  `יצירת שמרטפייה למתנדבי צח"י,  הכנת מעטפת מקצועית לצרכים חיונים כולל בעלי מקצוע נדרשים`
                ],
                "במהלך האירוע":[
                `אומדן נזקים, טיפול בהיבטים לוגיסטיים מיידים`,
                 
  `אזעקת מתנדבים בעלי מקצוע  וגורמי תחוזקה לביצוע משימות ומעקב עד להשלמתם,  רישום ותיעוד ביומן אירועים`,
                ],
                "שגרת חירום":[
        `הכנות לוגיסטיות לקליטה, מלוניות .אפשרויות הארחה`
                ]
            },
              color:"#FFA133"
    
            },
            {
              role: "מידע לציבור",
              id:5,
              tasksByPhases: {
                "לפני האירוע": [
                    "פרסום הנחיות פקע\"ר",
                    "הודעה על המועצה בדגש על הנחיות",
                    "אזור התרעה רלוונטי",
                    "מציאת 'הכי מוגן שיש'"
                ],
                
                "במהלך האירוע": [
                    "הודעה כל חצי יום עדכונים (מידע בדחיפה)",
                    "מתי יצא העדכון הבא",
                    "הוצאת הודעה על תמונת המצב באירוע",
                    "מידע רלוונטי לתושב"
                ],
                
                "שגרת חירום": [
                    "עדכון התושבים בנעשה",
                    "בדגש על האורחים ביישוב",
                    "יצירת קבוצת קשר נוספת על תושבי הקבע ביישוב"
                ]
                
            },
            messages: [
              "התקבלה התרעה על ירי רקטות וטילים יש להיכנס למרחב המוגן בהתאם לזמן ההתגוננות העומד לרשותנו ולשהות בו במשך 10 דקות. שימו לב, כוחות הביטחון סורקים את השטח, טרם ידוע על נפגעים או נזק, הודעה נוספת תצא בהקדם. לדיווחים דחופים: (מס‘ טלפון)",
              "חזרה לשגרה. אפשר לצאת מהמרחבים המוגנים, אנא הישארו בקרבת מרחב מוגן.",
              "לצערנו, בעקבות הירי יש נפגעים )פירוט, כולל האם מד,א בדרך או בשטח( אנחנו מבקשים מהתושבים להישאר בבתים ולאפשר לכוחות ההצלה לטפל באירוע ללא הפרעה. לדיווחים (מס‘ טלפון)",
              "נציגי המשפחות מתבקשים להשיב על הודעת בדיקת הנוכחות בקבוצות הווטסאפ או קישור למסמך.",
              "נשמעה אזעקה בישוב נא להכנס למרחבים המוגנים ולהמתין 10 דקות ואז ניתן לצאת מהמרחב המוגן. זכור! ההנחיות מצילות חיים!"
          ],
    
              color:"#9f4868ff"
    
            },
            {
              role: 'רפואה',
              id:6,
              tasksByPhases: {
               "לפני האירוע": [
    "הכרת נהלי חירום והפעלת הצוות",
    "וידוא ציוד רפואי תקין"
],

"במהלך האירוע": [
    "קבלת מידע ראשוני",
    "אזעקת הצוות",
    "התארגנות וחלוקת תפקידים",
    "סיוע והגשת עזרה ראשונה במקרה הצורך",
    "יצירת קשר עם גורמי רפואה (מד\"א, בתי חולים)"
],

"שגרת חירום": [
    "רשימת תושבים בעלי הכשרה רפואית",
    "רשימת מוסדות רפואיים ביישוב ובמרחב",
    "רשימת ציוד רפואי",
    "אספקת תרופות ומענה רפואי וסיעודי"
]

            },
              color:"#8f6a45ff"
            },
            {
              role: 'חינוך',
              id:7,
             tasksByPhases: {
              "לפני האירוע": [
    "הכרת נהלי חירום והנחיות",
    "שמירה על קשר רציף עם מוסדות החינוך למקרה של צורך בסיוע"
],

"במהלך האירוע": [
    "היערכות להפסקת לימודים ו/או למידה מרחוק",
    "רתימת הנוער והכנת החינוך הבלתי פורמאלי (תכנית למידה חלופית)",
    "הפעלת שמרטפיות לילדי העובדים החינוך"
],

"שגרת חירום": [
    "רשימת אנשי חינוך, מתנדבים ופעילים קהילתיים כולל תוכניות הפעלה לחינוך לא פורמאלי"
]

            },
              color:"#1a6da9ff"
            },
            {
              role: 'הנהלת היישוב',
              id:8,
             tasksByPhases: {
              "לפני האירוע": [
    "חבירה לצח\"י ויצירת נהלי ישוב לחירום וסדר יום מוגדר כולל הערכות מצב יומיות וקשר עם תושבים"
],

"במהלך האירוע": [
    "תכנית תמיכה למשפחות - מגויסים למילואים, נזקקים, מאובחנים"
],

"שגרת חירום": [
    "עבודה משותפת עם כל הצח\"י ליצירת מענה משלים קהילתי"
]

            },
            color:"#e8535f"
          },
          
        ]
    },
    {
      id: 4,
      color:"#e06666",
      situation: "תקיפת ישוב",
      description: "מצב חירום כאשר הישוב מותקף.",
      notes: [
        "השהייה מקסימלית של התוקפים ממגע עם האוכלוסיה",
        "מזעור למינימום האפשרי את החשיפה של האוכלוסייה לתוקפים",
        "לאפשר התערבות מהירה של כוחות ביטחון, רפואה וחילוץ",
        "התארגנות לפינוי האוכלוסייה במצב בטוח, גם תוך כדי לחימה, דרך מסדרון בטוח ליציאה",
        "פינוי האוכלוסייה בבטחה למקום מוגן"
    ],
    roles: [
      {
        role: `יו"ר צח"י`,
        id: 1,
        tasks: [ 
          "נוכחות חברי צח\"י",
          "מינוי חבר ל'ירוק בעיניים' (מניפה - מיפוי מיקום תושבים)",
          "הודעה (יחד עם מידע)",
          "סטטוס בבתים - כל 15 דקות",
          "סטטוס מצב צוותים ופעילותם",
          "וידוא קיום הנחיות"
      ],
            
        
        color: "#22b574ff"
    },
    
    
        {
          role: "ביטחון",
          id:2,
          tasks: [
            "כיתת כוננות + מפקד",
            "חלוקת גזרות",
            "קשר",
            "נוה\"ק",
            "הפעלת חמ\"ל",
            "איש קשר לצח\"י",
            "סגירת שערי יישוב +הגנה",
            "מיקום תצפית בנקודות שולטות",
            "הזעקת כוחות ביטחון, חילוץ והצלה",
            "הפעלת נושאי נשק ביישוב",
            "צוות רפואי"
        ],
          color:"#00AAD1"
        },
        {
          role:"רווחה",
          id:3,
          tasks:[
            "מיפוי אוכלוסיות רגישות",
            "מניפה",
            "תוכנית פינוי (יחד עם ביטחון ולוגיסטיקה)"
        ],
          color:"#ff984aff"

        },
        {
          role: "לוגיסטיקה",
          id:4,
          tasks: [
            "סגירת שערים",
            "רכבי פינוי אוכלוסייה",
            "רכבי פינוי רפואי",
            "חשמלאי",
            "מקלטים ומרחבים ממוגנים"
          ],
         
          color:"#FFA133"

        },
        {
          role: "מידע לציבור",
          id:5,
          tasks:[ "הודעות","מה קורה",
            "איפה קורה",
            "הנחיות"],
            messages:[
              "נציגי המשפחות מתבקשים להשיב על הודעת בדיקת הנוכחות בקבוצות הווטסאפ.",
              "נשלל החשש לאירוע חדירת מחבלים ליישוב. התושבים יכולים לצאת מהבתים ולנוע באזור ללא הגבלה. אם אתם או בני משפחתכם חשים מצוקה נפשית וחווים חרדה אנא פנו ל:",
              "בעקבות חדירת מחבלים ליישוב, יש להישאר במרחב המוגן ולהימנע משהייה מול הדלת והחלון. התנועה באזור אסורה. צה\"ל וכוחות הביטחון מטפלים באירוע. בכל אירוע חריג יש ליצור קשר עם כוחות הביטחון. הודעה נוספת תצא בהקדם. טלפון לדיווחים:",
              "בעקבות חשש לחדירת מחבלים/חדירת מחבלים ליישוב, יש להיכנס מיד למרחב מוגן בתוך הבית ולסגור היטב את הדלת. אין לעמוד מול הדלת והחלון, ויש להימנע מתנועה ומרעש. אין לצאת מהמרחב המוגן עד לקבלת הודעה רשמית מכוחות הביטחון. הודעה נוספת תשלח בהקדם. טלפון לדיווחים:"
          ],

          color:"#9f4868ff"

        },
        {
          role: 'רפואה',
          id:6,
          tasks: []
        ,
          color:"#8f6a45ff"
        },
        {
          role: 'חינוך',
          id:7,
         tasks: [
          "הנחיות למסגרות חינוך",
          "שליטה במיקום תלמידים + איש צוות"
      ],
          color:"#1a6da9ff"
        },
       
      
    ]
    },
   
   

      {
        id: 5,
        color:"#e06666",
        situation: "קריסת מבנה",
        description: "מצב חירום כאשר מבנה מתמוטט.",
        notes: [
            "נזק מרחבי מעבר לזירה עצמה",
            "נפגעים מוכרים מהיישוב - הודעות מידע לציבור והפעלת נערים",
            "הוצאת דרישה לאמצעים וסיוע כמה שיותר מהר",
            "דגש על יצירת מודיעין אוכלוסייה בזירה - מי בדיוק היה בה רגע לפני הפגיעה/קריסה"
        ],
        roles: [
          {
            role: `יו"ר צח"י`,
            id: 1,
            tasksByPhases: {
              "מענה ראשוני": [
                "יצירת תמ\"צ יישוב וזירה - מי נוכח, מי צריך סיוע, מי מנותק קשר"
              ],
              "במהלך האירוע": [
                "קבלת תמונת מצב ממנהל זירה ואיחוד התמונה עם אוכלוסייה",
                "ארגון צוותי חילוץ ומוכנות לקבלת סיוע מיישובים",
              ],
              "לאחר האירוע": [
                "שליטה באוכלוסייה ע\"י מודיעין ומידע לציבור",
                "שליטה בכמות נפגעים, חרדה, והודעות למשפחה"

              ]
            },
            color: "#22b574ff"
        },
        
        
            {
              role: "ביטחון",
              id:2,
              tasksByPhases: {
                "מענה ראשוני": [
                  "חבירה למנהל הזירה ובידוד הזירה"
                ],
                "במהלך האירוע": [
                  "סיוע למנהל הזירה בהתאם לצורך",
                  "הכוונת כוחות חילוץ בשער היישוב",
                  "השארת צירים פנויים מרכבים ומסקרנים"
                ],
                "לאחר האירוע": [
                  "לאחר טיפול בזירה - להשאיר נציג שיוודא שאף אחד שלא מורשה לא ייכנס אליה"
                ]
            },
              color:"#00AAD1"
            },
            {
              role:"רווחה",
              id:3,
              tasksByPhases: {
                "מענה ראשוני": [
                  "יצירת תמונת מצב מודיעין אוכלוסייה - מי ביישוב, מי בעבודה ומי מנותק קשר"
                ],
                "במהלך האירוע": [
                  "העברת נתוני אוכלוסייה למנהל זירה - מי בדיוק מתגורר במבנים שנפגעו",
                  "סיוע בהכוונת מתנדבי אד הוק (כולל בני נוער)",
                  "סגירת מעגלים מול מנהל זירה על כמות תושבים בזירה ומציאת פערים (השוואת רשימות)"
                ],
                "לאחר האירוע": [
                  "יצירת תכנית 'מענה משלים' קהילתי לשעות הקרובות ולימים הקרובים לאישור היו\"ר",
                  "סיוע נפשי לילדים ולנוער",
                  "הכנת צוות 'הודעה מרה' מהיישוב על כלל המשמעויות"
                ]
            },
              color:"#ff984aff"
    
            },
            {
              role: "לוגיסטיקה",
              id:4,
              tasksByPhases: {
                "מענה ראשוני": [
                  "טיפול במפגעים - סגירת חשמל, מים וגז בזירה"
                ],
                "במהלך האירוע": [
                  "אספקת אמצעי חילוץ - ג'קים, לומים, חבלים, שרשראות, טרקטורים ועוד",
                  "היערכות להארת הזירה בשעות החושך",
                  "סיוע שוטף במזון ושתייה למי שעובד בזירה"
                ],
                "לאחר האירוע": [
                  "פיקוח תברואתי באזור שנפגע ומתן ציוד לפינוי פסולת"
                ]
            },
              color:"#FFA133"
    
            },
            {
              role: "מידע לציבור",
              id:5,
              tasksByPhases: {
                "מענה ראשוני": [
                  "פרסום ראשוני על הזירה כמה שיותר מהר"
                ],
                "במהלך האירוע": [
                  "פרסום הנחייה להתרחקות סקרנים ומיקום ונציג קליטת מתנדבים",
                  "פרסום נפגעים כמה שיותר מהר (לאחר ההודעה המרה)",
                  "הודעות עדכון כל שעה על מצב החילוץ בזירה"
                ],
                "לאחר האירוע": [
                  "הודעה על הפסקת החילוץ ופרסום הנחיות יו\"ר בהתאם",
                  "התייחסות להצעות של מכלול אוכלוסייה על 'מענה משלים'"
                ]
            },
              color:"#9f4868ff"
    
            },
            {
              role: 'רפואה',
              id:6,
              tasksByPhases: {
                "מענה ראשוני": [
              "הזעקת הצוות הרפואי לאירוע ומתן ע\"ר לפי צורך"
            ],
            "במהלך האירוע": [
              "חבירה לכוחות ההצלה ומד\"א להמשך טיפול",
              "וידוא כלל נפגעים וטיפולם"
            ],
            "לאחר האירוע": [
              "פינוי לבית החולים לפי הצורך"
            ],
           
            },
              color:"#8f6a45ff"
            },
            {
              role: 'חינוך',
              id:7,
             tasksByPhases: {
                "מענה ראשוני":[
                 `במקרה של קריסת מבנה במוסד חינוכי- פינוי באופן מסודר על ידי הצוות ואנשי החינוך למיקום בטוח שהוגדר מראש. הוצאת הודעה להורים באמצעות מידע לציבור. במקרה של לכודים , הוצאת רשימת התלמידים והמורים שאמורים ךלהיות בבית הספר.`
                ],
                "במהלך האירוע":[
                  "במקרה של קריסת מבנה במוסד חינוכי- וידוא הימצאות כלל התלמידים והרגעתם, טיפול רפואי (עם רפואה) במקרה הצורך, "
                ]
          
            },
              color:"#1a6da9ff"
            },
            {
              role: 'מנהל זירה',
              id:8,
             tasksByPhases: {
              "מענה ראשוני": [
`סריקה ראשונית: תיחום הזירה העברת דיווח ליו"ר צח"י ובקשה לאמצעים/אנשים`              ],
              "במהלך האירוע": [
`הערכת זירה: מסוכנות, נפגעים, מבנים נוספים`   , 
 "ווידאו נטרול מפגעים -חשמל, גז, מים"
              ],
              "לאחר האירוע": [
                "הגדרת נתיבי כניסה ויציאה מהזירה",
                "קביעת נקודות - פצועים, הרוגים, חרדה, פינוי פסולת"
              ],
            },
            color:"#e8535f"
          },
          
        ]
      
        },
    
    
      
    {
      id:6,
      color:"#e06666",
      situation: "רעידת אדמה",
      description: " אסון טבע ברמה לאומית – ללא התראה/אזהרה.",
      notes: [
        "דרכי תקשורת משובשים – טלוויזיה, רדיו, סלולרי, טלפון וכו‘ – משמעויות התנהלות אחרת!",
        "פצועים, לכודים, מנותקי קשר",
        "פגיעה בתשתיות ואף מחוץ ליישוב – חשמל מים גז",
        "סיכון גבוה לשריפות",
        "רעידות משנה – סכנה לקריסות בתים נוספים",
        "רוב הניצולים יהיו בחילוץ עצמאי – שעות הראשונות של האירוע (אפילו עד 72 שעות)",
        "כמות גדולה של תושבים מחוסרי גג"
    ]
    ,
    roles:[
        {
        role: `יו"ר צח"י`,
        id: 1,
        tasksByPhases: {
          "מענה ראשוני": [
            "יצירת תמונת מצב יישובית: אוכלוסיה ונזק לבתים ותשתיות, הכוונת פעולות חילוץ בהתאם למודיעין אוכלוסייה (מיקומי לכודים)"
        ],
        "במהלך האירוע": [
            "בדיקה מחודשת לתיעדוף למאמצי החילוץ ולטיפול בתשתיות (מים תחילה)",
            "הערכות כללית להפסקות חשמל ומים ארוכות"
        ],
        "מענה משלים": [
            "שליטה באוכלוסייה על מידע לציבור",
            "היערכות לטיפול במחוסרי גג",
            "הודעות עדכון למועצה סיוע וטיפול למחוסרי בית"
        ]
        },
        color: "#22b574ff"
      },
      {
        role: "ביטחון",
        id: 2,
        tasksByPhases: {
    
          "מענה ראשוני": [
            "יצירת תמונת מצב של זירות עם בתים שקרסו על ידי סריקה פיזית ביישוב",
            "סיוע במאמץ החילוץ לצוותי החילוץ"
        ],
        "במהלך האירוע": [
            "המשך סיוע במאמץ החילוץ לצוותי החילוץ",
            "בידוד וסימון בתים בסכנת קריסה",
            "בידוד וסימון אתרים מסכני חיים (חשמל, בורות וכו')"
        ]
          },
        color: "#00AAD1"
      },
      {
        role:"רווחה",
        id: 3,
        tasksByPhases: {
          "מענה ראשוני": [
            "יצירת תמונת מצב מודיעין אוכלוסייה – מי ביישוב, מי בעבודה ומי מנותק קשר",
            "המלצה לתוכנית סיוע לאוכלוסייה חלשה"
        ],
        "במהלך האירוע": [
            "טיפול בנפגעים בגוף ונפגעי חרדה",
            "הערכות לקליטת מתנדבים ספונטניים",
            `יצירת שמרטפיה למתנדבי צח"י`
        ]
          },
        color: "#ff984aff"
      },
      {
        role: "לוגיסטיקה",
        id: 4,
        tasksByPhases: {
          "מענה ראשוני": [
            "מיפוי נזקי תשתיות – מים, חשמל, דרכי גישה",
            "טיפול בסיכונים בתשתיות שנפגעו – מים בעדיפות על הכל, חשמל, דרכי גישה בתוך היישוב ואליו"
        ],
        "במהלך האירוע": [
            "המשך עבודה על חידוש תשתיות",
            "הגדרת מבנים בסכנת קריסה"
        ],
        "לאחר האירוע": [
            "סיוע לוגיסטי למחוסרי גג",
            "הערכות כללית להפסקות חשמל ומים ארוכות"
        ]
          },
        color: "#FFA133"
      },
      {
        role: "מידע לציבור",
        id: 5,
        tasksByPhases: {
          "מענה ראשוני": [
            "פרסום הנחיות התנהגות בעת רעידות משנה וזיהוי עצמי של בתים שנפגעו ועלולים לקרוס"
        ],
        "במהלך האירוע": [
            "הודעה לאוכלוסייה על מיקומים בהם נדרשות 'ידיים עובדות' ביישוב"
        ],
        "לאחר האירוע": [
            "פרסום ריכוז מתקני קליטה וסיוע",
            "הודעה כל חצי יום עדכונים",
            "פרסום נהלי יישוב בחירום ודרכי תקשורת לחמ\"ל"
        ]

          },
        color: "#9f4868ff"
      },
      {
        role: 'רפואה',
        id:6,
        tasksByPhases: {
          "מענה ראשוני": [
            "שליחת צוות רפואי מתן ע\"ר לזקקים לפי הצורך"
        ],
        "במהלך האירוע": [
            "חבירה למד\"א וכוחות ההצלה ופינוים לבתי החולים לפי צורך"
        ],
        "לאחר האירוע": [
            "וידוא כלל נפגעים וטיפולם. פינוי לבית החולים לפי הצורך"
        ]

      },
        color:"#8f6a45ff"
      },
      {
        role: 'חינוך',
        id:7,
       tasksByPhases: {
    "מענה ראשוני": [
        "הכרת נהלים וביצועם, מרחב מגון/מתחת לשולחן וכו."
    ],
    "במהלך האירוע": [
        "וידוא הימצאות כלל התלמידים ומצבם, יצירת קשר עם ההורים"
    ],
    "לאחר האירוע": [
        "יצירת תכנית למידה אלטרנטיבית/העסקת נוער"
    ]
      },
      messages:[
        "תושבות ותושבים יקרים שימו לב: הורגשה רעידת אדמה באיזורנו. האירוע מטופל על ידי צוות הצ\"חי וכוחות החרום. התושבים מתבקשים לחכות להמשך עדכונים, הודעה נוספת תצא בעשר הדקות הקרובות. יש לדווח על כל אירוע חריג לחמ\"ל הצ\"חי בטלפון _____.",
        "תושבות ותושבים יקרים שימו לב, עקב הרעידת אדמה, המבנה.... במיקום...... קרס. אין נפגעים / בשלב זה לא ידוע לנו על נפגעים. אנא התרחקו מהמקום ואפשרו לחברי הצ\"חי להגיע ולטפל בזירה. בשל החשש לפגיעה בתשתיות חשמל, מים וגז ייתכנו הפסקות חשמל ומים יזומות. יש לדווח לחמ\"ל הצ\"חי על כל אירוע חריג בטלפון _. עדכון נוסף יתפרסם בהקדם."
    ],
        color:"#1a6da9ff"
      },
      {
        role: 'צוות חילוץ',
        id:8,
       tasksByPhases: {
        "מענה ראשוני": [
          "עבודה על זירות הרס – כל מוכשר סע\"ר ינהל קבוצת מתנדבים במקום מגוריו בשעות הראשונות"
      ],
      "במהלך האירוע": [
          "העברת תמונת מצב ליו\"ר צח\"י – מידת הרס, כמות לכודים, כמות מחלצים פועלים"
      ],
      "לאחר האירוע": [
          "סיוע ליישובים נוספים בהתאם להנחיות מועצה"
      ]

      },
      color:"#e8535f"
    },
    ],
    },
    




    {
      id:7,
      color:"#e06666",
      situation: "שריפה",
      description: "מצב חירום עקב שריפה בשטח.",
      notes: [
        "סכנת חיים מיידית - חייבת תגובה מהירה והחלטית",
        "פגיעה בתשתיות - חשמל, כבישים חסומים וכו..",
        "צורך בפינוי מיידי ולעיתים אילתורים בפינוי (כגון הליכה רגלית, הסעה ע\"ג קלאב קאר ועוד)",
        "טיפול מתמשך במפונים וטיפול פרטני באלה שביתם נשרף"
    ],
    roles:[
      {
        role: "יו\"ר צח\"י",
        id: 1,
        tasksByPhases: {
          "בשגרה": [
            `קבלת הערכה מקב"ט על שריפות באיזור`,
            "שריפות גבוהה ועדכון ראשי הצוותים בצח\"י"
          ],
          "במהלך האירוע (שריפה מוגבלת)": [
            "הגדרת ראש צוות כיבוי וצוותו",
            "יצירת תמ\"צ יישוב, עדכון המועצה וצח\"י",
            "הבנת מידת האיום והגדרת דחיפות להיערכות לפינוי או פינוי בפועל של שכונה/יישוב שלם",
            "הנחייה על בניית תכנית עבודה לפינוי ותיכלול כל הצוותים"
          ],
          "לאחר הבנה/הנחייה על היערכות או ביצוע פינוי": [
            "שליטה באוכלוסייה ע\"י מודיעין ומידע לציבור",
            "חבירה לכוחות חיצוניים וקבלת תמ\"צ רלוונטית"
          ],
          "לאחר האירוע (פינוי אוכלוסיה)": [
            "דיווח למועצה/חפ\"ק שכלל התושבים פונו",
            "תיכלול מיפוי מקים פיסיים ולתושבים שאינם יכולים לחזור לבתיהם",
            "כתיבת תהליך חזרה לשגרה"
          ]
        },
        color: "#22b574ff"
      },
      {
        role: "ביטחון",
        id: 2,
        tasksByPhases: {
          "בשגרה": [
            "לקבוע רשימת צופי אש וסיורים בשטח מסביב לשעון הכנת ציוד יחד עם צוות הלוגיסטיקה"
          ],
          "במהלך האירוע (שריפה מוגבלת)": [
            "הזעקת כוחות חירום כב\"ה, משטרה, מד\"א ו\"שדכן\" בשער היישוב להכוונה",
            "קבלת מודיעין אוכלוסייה לגבי תושבים בזירה",
            "סריקה בזירה לפי סדרי עדיפויות (בבית, בחו\"ל וכו)",
            "בידוד הזירה מסקרנים"
          ],
          "לאחר הבנה/הנחייה על היערכות או ביצוע פינוי": [
            "הוצאה לפועל של תכנית הפינוי (אם נדרש)",
            "הצבת מחסומים הכוונה התנועה",
            "עדכון שוטף של יו\"ר צח\"י ומכלול אוכלוסייה על התקדמות הסריקות"
          ],
          "לאחר האירוע (פינוי אוכלוסיה)": [
            "שמירה על סדר ציבורי וחסימת אזורים בעלי סיכון התלקחות",
            "מיפוי נזקים לבתי תושבים"
          ]
        },
        color: "#00AAD1"
      },
      {
        role:"רווחה",
        id: 3,
        tasksByPhases: {
       "בשגרה": [
    "ריענון רשימות תושבים במיוחד באזורים המועדים/בסיכון לשריפה"
  ],
  "במהלך האירוע (שריפה מוגבלת)": [
    "יצירת תמונת מצב מודיעין אוכלוסייה - מי ביישוב ומי מנותק קשר בדגש על איזור השריפה",
    "המלצה לתוכנית סריקה לפי נתוני תמונת מצב אוכלוסייה",
    "טיפול בנפגעי חרדה - מפונים, באיזור השריפה"
  ],
  "לאחר הבנה/הנחייה על היערכות או ביצוע פינוי": [
    "ביצוע מעקב שמי על המפונים",
    "סיוע לנפגעי חרדה והגדרת טיפול ראשוני במפונים",
    "מעקב שמי אחר מפונים והעברת פערים (ליו\"ר וביטחון)",
    "מיפוי של תושבים שאינם יכולים לחזור לבתיהם"
  ],
  "לאחר השריפה (פינוי אוכלוסיה)": [
    "ליווי וטיפול בנפגעי חרדה ואלה שביתם נשרף"
  ]
          },
        color: "#ff984aff"
      },
      {
        role: "לוגיסטיקה",
        id: 4,
        tasksByPhases: {
            "בשגרה": [
                "טיפול וסילוק מפגעים פוטנציאליים, מיפוי אזורי כיסוי הידראנטים, הכנת ציוד - נייד וזמין"
            ],
            "באירוע שריפה מוגבל (ללא היערכות לפינוי)": [
                "סילוק מפגעי תשתית מהזירה - חשמל, גז, רכבים וכו",
                "גיוס אמצעי הנדסה - כגון טרקטורים ליצירת חציצה",
                "מיפוי חומרים מסוכנים והמלצה לטיפול"
            ],
            "לאחר הבנה/הנחייה על היערכות או ביצוע פינוי": [
                "הכשרת דרכי כניסה ויציאה מהיישוב והמלצה על תוואי הפינוי למחלקת ביטחון",
                "סיוע באמצעי הובלה/הסעה של המפונים",
                "הקמה לוגיסטית של נקודת קליטה ופינוי פצועים"
            ],
          "לאחר הפינוי":[
            "סיוע לוגיסטי למפונים בנקודת הפינוי",
            "מיפוי נזקים לתשתיות החיוניות של היישוב"
        ]
          },
        color: "#FFA133"
      },
      {
        role: "מידע לציבור",
        id: 5,
        tasksByPhases: {
         "בשגרה": [
    `ריענון הודעות נצורות:
למקרה שריפה, היערכות
לפינוי ופינוי`
  ],
  "במהלך האירוע (שריפה מוגבלת)": [
   `הודעה מוכנה מראש על
מיקום השריפה והנחיות
ראשוניות`,
    `
הוצאת הנחיות משטרה
וכב"ה`,
   `הודעות שוטפות על
התקדמות האירוע ומתי
יצא העדכון הבא`
  ],
  "לאחר הבנה/הנחייה על היערכות או ביצוע פינוי": [
    `הודעה על היערכות לפינוי
או פינוי בפועל`,
    `הודעות על:
מסלול הפינוי ופתיחת
נקודת קליטת מפונים`
  ],
  "לאחר השריפה (פינוי אוכלוסיה)": [
`הודעות על המשך הטיפול

בשריפה ובמפונים

עדכון על סיום הפינוי
וצעדים הבאים`  ]
          },
        color: "#9f4868ff",
        messages:["עקב מזג אויר יבש וחם בימים הקרובים / בתאריכים ___ אסורה הדלקת מדורות. יש לשמור על ערנות ולדווח על כל אירוע חריג.",
          "שריפה [במיקום] בטיפול צוות הצח”י אשר נמצא במקום. צוותי כיבוי אש בדרך. מתבקשים להימנע מלהגיע לאזור ולשמור על הדרכים פנויות.",
          "השריפה בטיפול כוחות הכיבוי וצוות הצח”י ונמצאת בשליטה. עקב התפשטות עשן מתבקשים להיכנס לבתים ולסגור את החלונות.",
          "השריפה בשליטה של כוחות הכיבוי / כובתה. ניתן לחזור לשגרה. אפשר לצאת מהבתים. התושבים מתבקשים לא להגיע לאזור השריפה.",
          "עקב התפשטות השריפה קיימת סכנה מיידית לתושבים בשכונת ]שם השכונה[. התושבים מתבקשים להתפנות באופן מיידי מהבתים אל נקודת הרישום ולדווח האם מתפנים למקום עצמאי או לנקודת הפינוי המסודרת היישובית. ב ]מיקום נקודת הפינוי ביישוב[, מי שזקוק לסיוע יש ליצור קשר מיידי בטלפון [מספר טלפון]. שאר התושבים מתבקשים להישאר בבתים ולסגור את החלונות. אין להסתובב בחוץ על מנת להימנע משאיפת עשן והפרעה לכוחות הבטחון.",
          "עקב התפשטות השריפה קיימת סכנה מיידית של הגעת האש לבתים כוחות הביטחון הורו על פינוי מיידי של היישוב. התושבים מתבקשים להתפנות באופן מיידי מהבתים לנקודת הרישום ולדווח האם מתפנים למקום עצמאי או לנקודת פינוי היישובית המסודרת. ב- בפינוי עצמאי יש לדווח בהודעה לטלפון מספר ]מספר טלפון[. מי שזקוק לסיוע יש ליצור קשר מיידי בטלפון ]מספר טלפון[. אין להסתובב בחוץ על מנת להימנע משאיפת עשן והפרעה לכוחות הבטחון. לגבי אירוע חומרים מסוכנים - ראה פרק נפרד בפנקס זה."
        ]
      },
      {
        role: 'רפואה',
        id:6,
        tasksByPhases: {
          "בשגרה": [
            "הכנת הצוות הרפואי ווידוא נהלים למקרי שריפה ומתן ע\"ר במקרה הצורך"
          ],
          "במהלך האירוע (שריפה מוגבלת)": [
            "אזעקת הצוות הרפואי לאירוע למתן ע\"ר ויצירת תמונת מצב לגבי הנפגעים וטיפולם עד הגעת כוחות ההצלה",
            "חבירה לכוחות ההצלה והעברת הטיפול להם/ביחד איתם"
          ],
          "לאחר הבנה/הנחייה על היערכות או ביצוע פינוי": [
            "מנוחה וחידוש הציוד, מוכנות לתת מענה במקרה הצורך"
          ],
          "לאחר השריפה (פינוי אוכלוסיה)": [
            "מתן עזרה רפואית למפונים ולנפגעי השריפה"
          ]

      },
        color:"#8f6a45ff"
      },
      {
        role: 'חינוך',
        id:7,
       tasksByPhases: {
    "מענה ראשוני": [
        "הכרת נהלים וביצועם, מרחב מגון/דרכי מילוט באופן מסודר וכו."
    ],
    "במהלך האירוע": [
        "וידוא הימצאות כלל התלמידים ומצבם, יצירת קשר עם ההורים"
    ],
    "לאחר האירוע": [
        "יצירת תכנית למידה אלטרנטיבית/העסקת נוער"
    ]
      },
      messages:[
        "תושבות ותושבים יקרים שימו לב: הורגשה רעידת אדמה באיזורנו. האירוע מטופל על ידי צוות הצ\"חי וכוחות החרום. התושבים מתבקשים לחכות להמשך עדכונים, הודעה נוספת תצא בעשר הדקות הקרובות. יש לדווח על כל אירוע חריג לחמ\"ל הצ\"חי בטלפון _____.",
        "תושבות ותושבים יקרים שימו לב, עקב הרעידת אדמה, המבנה.... במיקום...... קרס. אין נפגעים / בשלב זה לא ידוע לנו על נפגעים. אנא התרחקו מהמקום ואפשרו לחברי הצ\"חי להגיע ולטפל בזירה. בשל החשש לפגיעה בתשתיות חשמל, מים וגז ייתכנו הפסקות חשמל ומים יזומות. יש לדווח לחמ\"ל הצ\"חי על כל אירוע חריג בטלפון _. עדכון נוסף יתפרסם בהקדם."
    ],
        color:"#1a6da9ff"
      },
      {
        role: 'צוות כיבוי בזירה',
        id:8,
       tasksByPhases: {
      "בשגרה": [
    "ביצוע אימון 'רטוב' של הצוות על כלל הציודים"
  ],
  "במהלך האירוע (שריפה מוגבלת)": [
    "הגדרת תיחום האירוע וביצוע פעולות כיבוי בזירה ע\"ב הידראנטים, מטפים, מחבטי אש וכו'",
    "אבחנה במימדי האיום - בהתאם לרוח, אמצעי הובלה ומזג אוויר",
    "בידוד הזירה - בלוני גז, חשמל, רכבים וכו'",
    "דיווח ליו\"ר צח\"י כל 10 דק' לפחות"
  ],
  "לאחר הבנה/הנחייה על היערכות או ביצוע פינוי": [
    "המשך לחימה באש, תוך דגש על עיכוב התקדמות האש לנתיב הפינוי המתוכנן"
  ],
  "לאחר השריפה (פינוי אוכלוסיה)": [
    "מנוחה וחידוש הציוד",
    "מוכנות מלאה לתת מענה למקרה התלקחות מחודשת"
  ]

      },
      color:"#e8535f"
    },
    
    ],
    },
    {
      id: 8,
      color:"#e06666",
      situation: `פגיעה בתשתיות חיוניות`,
      description: "מצב בו נפגעות תשתיות מים , חשמל ותקושרת",
      notes:  [
        "השיבושים יכולים להימשך מספר ימים, ייתכן גם ברציפות.",
        "בהחזרת חשמל לפרקי זמן קצרים יש לנצל לטעינת סלולר/רדיו/אמצעים קריטיים.",
        "הפסקת אספקת מים עלולה להיות קריטית לאוכלוסיות שונות וחייבת לקבל מענה מיידי.",
        "יש להקפיד על שימוש מושכל וחסכוני מאוד.",
        "פגיעה ברוב האוכלוסייה וסכנת חיים עבור בודדים שנדרשים למכשירי מצילי חיים המחוברים לחשמל.",
        "שיבושים משמעותיים המייצרים לחץ ומעלים את רמת החרדה.",
        "הנחיה לציבור (ראה הודעות נצורות) לחיסכון במים וצריכת חשמל.",
        "מתן מענה מציל חיים לאוכלוסיות נזקקות ותמיכה באוכלוסיות חלשות.",
        "הפצת מידע בנתק תקשורת על ידי אמצעים פיזיים (כריזה, פליירים, לוח מודעות) ופתיחת מוקד מידע פיזי.",
        "חלוקת מים יחד עם פרסום מקומות בהן ניתן להשיג מים גם מחוץ ליישוב."
      ],
    roles:[
      {
      role: `יו"ר צח"י`,
      id: 1,
      tasksByPhases: {
        "בשגרה": [
        `
הכרת תרחיש הייחוס והכנת המענה היישוב ומיפוי תשתיות היישוב`
      ],
      "מענה ראשוני": [
         `הבנת חומרת הפגיעה – מקומי (רמת היישוב/מועצה) או ברמת המדינה. לבדוק עם המועצה הערכות להחמרה בהתאם להערכת המצב
`
      ],
      "מענה משלים": [
          "ניהול הערכות מצב שוטפות וקבלת החלטות – צפי להמשך, תמונת מצב אוכלוסייה, מצב תשתיות חשמל ומים ביישוב",
         `
תעדוף משאבים עם מתן תעדוף לאוכלוסייה נזקקת. ביצוע תכנית חלוקת מים בעת הצורך`
      ]
      },
      color: "#22b574ff"
    },
    {
      role: "ביטחון",
      id: 2,
      tasksByPhases: {
        "בשגרה": [
          "הכנת אמצעי גידור ובידוד לאיזור הנפגע"
        ]


        },
      color: "#00AAD1"
    },
    {
      role:"רווחה",
      id: 3,
      tasksByPhases: {
        "בשגרה": [
          `הכנת מתקני קליטה למקרי חירום.`
        ],
        "מענה ראשוני": [
           `בדיקת מצב אוכלוסייה סיעודית/מבוגרת שהכל תקין והאם צריך עזרה כלשהיא`
        ]
       
        },
      color: "#ff984aff"
    },
    {
      role: "לוגיסטיקה",
      id: 4,
      tasksByPhases: {
        "בשגרה": [
          `הכנת גנרטורים והכנת הספקת מים נאותה למקרי חירום  `
        ],
        "מענה ראשוני": [
           `הספקת אמצעי חשמל חלופי והספקת מים במקרה הצורך בדגש על אוכלוסיה חלשה/מבוגרת`
        ]
        },
      color: "#FFA133"
    },
    {
      role: "מידע לציבור",
      id: 5,
      tasksByPhases: {
        "בשגרה": [
          `הכנת הודעות נצורות למקרי פגיעה בתשתיות חיוניות`
        ],
        "מענה ראשוני": [ `שליחת הודעות נצורות במהירות על מנת לידע את כלל האוכלוסייה במפגע.`        ],
        },
      color: "#9f4868ff",
      messages: [
        "הפסקת החשמל בטיפול אך ללא צפי לתיקון כרגע. גנרטור הופעל ב (מבנה) (שם המקום) לטובת התושבים. מי שזקוק לסיוע מתבקש לפנות לטלפון [מספר טלפון].",
        "הפסקת החשמל בטיפול אך ללא צפי לתיקון כרגע. בעקבות זאת צפויים שיבושים באמצעי התקשורת. לפיכך, יש לעשות שימוש מושכל במכשירים הניידים ולחסוך בצריכת החשמל. אנו מעמידים לרשות התושבים גנרטור ומספר שקעי טעינה עבור טלפונים ניידים בלבד.",
        "יש הפסקת חשמל בכל היישוב / שכונת [שם השכונה]. התקלה בטיפול חברת החשמל. הצפי לתיקון התקלה הינו [זמן].",
        "בעקבות (תקלה/פעולה זדונית/הפסקת חשמל/זיהום מערכת המים), קיימת הפסקת מים ביישוב. הצפי לתיקון התקלה הינו [זמן]. לצערנו אין צפי לתיקון הפסקת המים. אנו נערכים לחלוקת מים לשתייה בלבד. עד לתיקון המערכת והשבת המצב לקדמותו, יש להגביל את צריכת המים ולהשתמש במים שנותרו בצינורות ובדוד השמש לשתייה בלבד/אין להשתמש במים. אין להשתמש במים לצורכי השקייה ושטיפה ונדרש לחסוך במים. (אם נפתחת תחנת חלוקה) – ניתן להגיע לתחנת חלוקת מים שנפתחה ב-___, בשעות _____. יש/לא נדרש להגיע עם כלי קיבול."
    ]
      
    },
    {
      role: 'רפואה',
      id:6,
      tasksByPhases: {
        "בשגרה": [
`זמינות למקרים רפואים ומתן ע"ר` ]
    },
      color:"#8f6a45ff"
    },
    {
      role: 'חינוך',
      id:7,
     tasksByPhases: {
  "מענה ראשוני": [
      "הכנת תוכנית למידה אלטרנטיבית למקרה של הפסקת לימודים."
  ],
  "במהלך האירוע": [
"במקרה של היעדר חשמל, מתן פתרון ללימודים מרחוק/ פתרון אחר." 
 ]
    },
    messages:[
      "תושבות ותושבים יקרים שימו לב: הורגשה רעידת אדמה באיזורנו. האירוע מטופל על ידי צוות הצ\"חי וכוחות החרום. התושבים מתבקשים לחכות להמשך עדכונים, הודעה נוספת תצא בעשר הדקות הקרובות. יש לדווח על כל אירוע חריג לחמ\"ל הצ\"חי בטלפון _____.",
      "תושבות ותושבים יקרים שימו לב, עקב הרעידת אדמה, המבנה.... במיקום...... קרס. אין נפגעים / בשלב זה לא ידוע לנו על נפגעים. אנא התרחקו מהמקום ואפשרו לחברי הצ\"חי להגיע ולטפל בזירה. בשל החשש לפגיעה בתשתיות חשמל, מים וגז ייתכנו הפסקות חשמל ומים יזומות. יש לדווח לחמ\"ל הצ\"חי על כל אירוע חריג בטלפון _. עדכון נוסף יתפרסם בהקדם."
  ],
      color:"#1a6da9ff"
    },
   
  ],
    },
    {
      id: 9,
      color:"#e06666",
      situation: `מזג אוויר קיצוני`,
      description: "מצב שקורה כאשר יש עומס חום קיצוני או קור קיצוני והצפות ",
      notes: [
        "בשנים האחרונות מזג האויר נהיה קיצוני – מחד יותר חם ויבש בקיץ כולל בעונות מעבר",
        "ומאידך כמויות משקעים רבות בפרק זמן קצר מאד וצניחת טמפ‘ בחודשי החורף.",
        "נפגעים עיקריים ממז“א קיצוני )קור/חום(– תינוקות, קשישים, אוכלוסיות מועדות אחרות הרגישות לקור/חום",
        "ונזזקקות לאספקת חשמל ומים רציפה לקיום החיים.",
        "סיוע הדדי בין כלל התושבים הינו קריטי ויצטרך להיות מוכוון ע“י הצח“י )מכלול אוכלוסייה( לאוכלוסיות",
        "שאינן יכולות להסתדר בכוחות עצמם",
        "יכולת חיזוי מרשימה שמייצרת התראות מספר ימים לפני גלי קור/חום – יש זמן להיערכות"
    ],
    roles:[
      {
      role: `יו"ר צח"י`,
      id: 1,
      tasksByPhases: {
        "בשגרה": [
            "הכנת תכנית מגירה של הצח\"י עם הנהגת היישוב וביצוע תרגול שולחני יזום בשני התרחישים – חום וקור"
        ],
        " בקבלת התראה על מז\"א קיצוני": [
          "גזירת המשמעויות לגבי לימודים ואוכלוסיות מועדות לפגיעה"
      ],
        "באירוע": [
          "יש לפעול בהתאם לאירוע פגיעה בתשתיות או פינוי בית ספר"
      ],
      "לאחר האירוע":[
          "בקרת נזמים וטיפול בהם, היערכות לאירועים דומים תוך זמן קצר"
      ]
      },
      color: "#22b574ff"
    },
    {
      role: "ביטחון",
      id: 2,
      tasksByPhases: {
        "בשגרה": [
          "הכנת תכנית מגירה של הצח\"י עם הנהגת היישוב וביצוע תרגול שולחני יזום בשני התרחישים – חום וקור"
      ],
        " בקבלת התראה על מז\"א קיצוני": [
           "בהתאם להנחיית יו\"ר, ביצוע מלא/חלקי של מעבר משגרה לחירום"
      ],
         "באירוע": [
            "יש לפעול בהתאם לאירוע פגיעה בתשתיות או פינוי בית ספר"
          ],
        "לאחר האירוע":[
        "בקרת נזמים וטיפול בהם, היערכות לאירועים דומים תוך זמן קצר"
      ]
        },
      color: "#00AAD1"
    },
    {
      role:"רווחה",
      id: 3,
      tasksByPhases: {
          "בשגרה": [
            "הכנת תכנית מגירה של הצח\"י עם הנהגת היישוב וביצוע תרגול שולחני יזום בשני התרחישים – חום וקור",
            "הגדרה ועדכון עיתי של רשימות אנשים בסכנת חיים בהפסקת חשמל/מים ובעיות בריאות - קשיי נשימה"


          ],
          " בקבלת התראה על מז\"א קיצוני":[
             "יצירת מיפוי עדכני של אוכלוסיות מועדות לפגיעה ממז\"א קיצוני, משמעויות לגבי לימודים והפעלת 'למידה מרחוק' ו/או מערכת חינוך בלתי פורמאלית"
          ],
          "באירוע": [
             "יש לפעול בהתאם לאירוע פגיעה בתשתיות או פינוי בית ספר"
          ],
        "לאחר האירוע":[
          "בקרת נזמים וטיפול בהם, היערכות לאירועים דומים תוך זמן קצר"
      ]
        },
      color: "#ff984aff"
    },
    {
      role: "לוגיסטיקה",
      id: 4,
      tasksByPhases: {
        "בשגרה": [
          "הכנת תכנית מגירה של הצח\"י עם הנהגת היישוב וביצוע תרגול שולחני יזום בשני התרחישים – חום וקור"
      ],
      " בקבלת התראה על מז\"א קיצוני": [
             "ניקיון של פתחי ניקוז מועדים לסתימה, גיזום עצים"
          ],
          "באירוע": [
           "יש לפעול בהתאם לאירוע פגיעה בתשתיות או פינוי בית ספר"
          ],
        "לאחר האירוע":[
        "בקרת נזמים וטיפול בהם, היערכות לאירועים דומים תוך זמן קצר"
      ]
        },
      color: "#FFA133"
    },
    {
      role: "מידע לציבור",
      id: 5,
      tasksByPhases: {
          "בשגרה": [
            "הכנת תכנית מגירה של הצח\"י עם הנהגת היישוב וביצוע תרגול שולחני יזום בשני התרחישים – חום וקור",
            "הכנת הודעות נצורות למקרה הצורך"
          ],
          " בקבלת התראה על מז\"א קיצוני": [
            "פרסום הנחיות מועצה והמלצות להצטיידות בהתאם"
          ],
          "באירוע":[
            "יש לפעול בהתאם לאירוע פגיעה בתשתיות או פינוי בית ספר"
          ],
        "לאחר האירוע":[
        "בקרת נזמים וטיפול בהם, היערכות לאירועים דומים תוך זמן קצר"
      ]
        },
      color: "#9f4868ff",
      messages: [
        "\u202Bתושבות ותושבים יקרים, \u202Bבימים הקרובים צפוי מזג האוויר קיצוני. \u202Bצוות הצ\"חי נערך ויסייע במידת הצורך ב___ (תלוי תרחיש). \u202Bהתושבים מתבקשים לפעול על פי ההנחיות הבאות (תלוי תרחיש). \u202Bיש לדווח על כל אירוע חריג ל__ בטלפון _."
      ]
    },
    {
      role: 'רפואה',
      id:6,
      tasksByPhases: {
        "בשגרה": [
`חסר מידע` ]
    },
      color:"#8f6a45ff"
    },
    {
      role: 'חינוך',
      id:7,
     tasksByPhases: {
  "מענה ראשוני": [
      "חסר מידע"
  ],
  "במהלך האירוע": [
`חסר מידע` ]
    },
    
      color:"#1a6da9ff"
    },
    {
      role: `הנהלת הישוב`,
      id: 8,
      tasksByPhases: {
          "בשגרה": [
            "הכנת תכנית מגירה של הצח\"י עם הנהגת היישוב וביצוע תרגול שולחני יזום בשני התרחישים – חום וקור",
            "לקראת חורף – הכנת תשתיות, ניקיון פתחי ניקוז וגיזום עצים שעלולים לקרוס על בתים וקווי חשמל"
          ],
          " בקבלת התראה על מז\"א קיצוני": [
              "הגדרת קבלני תשתיות, ווידוא ציוד פינוי מוכנות ובכוננות בהתאם, הגדרת כוננים"
          ],
          "באירוע": [
             "יש לפעול בהתאם לאירוע פגיעה בתשתיות או פינוי בית ספר"
          ],
        "לאחר האירוע":[
         "בקרת נזמים וטיפול בהם, היערכות לאירועים דומים תוך זמן קצר"
      ]
        },
      color: "#e8535f"
    }
  ],
      
    },
    {
      id: 10,
      color:"#e06666",
      situation: `חומר מסוכן`,
      description: "מצב שקורה כאשר יש עומס חום קיצוני או קור קיצוני והצפות ",
      notes: [
        "מחייב תגובה מיידית ומוגבלת – אסורה כניסה לאזור ללא מיגון מתאים",
        "חומר מסוכן קיים בכל מקום – בריכות, גז ביתי, אמצעי קירור, מפעלים סמוכים, משאיות מובילים",
        "הסתגרות מיידית באזור הסיכון )סגירת חלונות ודלתות וכד’(– בהתאם להנחיות משטרה וכב”ה.",
        "חומר מסוכן מתנדף בהתאם למזג אוויר )ברום שמסוכן גם הוא אך אינו מתנדף ונשאר בזירת האירוע – לא נדון כאן(",
        "אחריות על הנחיות – משטרה דרך המועצה או ישירות"
      ],
    roles:[
      {
      role: `יו"ר צח"י`,
      id: 1,
      tasksByPhases: 
    {   "מענה ראשוני": [
      `יצירת תמ"צ יישוב וזירה מי נוכח, מי צריך סיוע, מי מנותק קשר`
   ],
   " במהלך האירוע": [
      `קבלת תמונת מצב ממנהל זירה ואיחוד התמונה עם אוכלוסייה`,
      `אירגון צוותי חילוץ ומוכנות לקבלת סיוע מיישובים`
   ]
      }
      ,
      color: "#22b574ff"
    },
    {
      role: "ביטחון",
      id: 2,
      tasksByPhases: 
    {   "מענה ראשוני": [
`חבירה למנהל הזירה ובידוד הזירה`   ],
   " במהלך האירוע": [
      `סיוע למנהל הזירה בהתאם לצורך`,
`הכוונת כוחות חומ"ס והצלה בשער היישוב`   ]
      }
      ,
        
      color: "#00AAD1"
    },
    {
      role:"רווחה",
      id: 3,
      tasksByPhases: 
      {   "מענה ראשוני": [
 `יצירת תמונת מצב מודיעין אוכלוסייה - מי ביישוב, מי בעבודה ומי מנותק קשר`   ],
     " במהלך האירוע": [
       `העברת נתוני אוכלוסייה למנהל זירה - מי בדיוק מתגורר במבנים שנפגעו`,
  `סיוע בהכוונת מתנדבי אד הוק  סגירת מעגלים מול מנהל זירה על כמות תושבים בזירה ומציאת פערים (השוואת רשימות)`   ]
        },
      color: "#ff984aff"
    },
    {
      role: "לוגיסטיקה",
      id: 4,
      tasksByPhases: 
      {   "מענה ראשוני": [ 
`טיפול במפגעים - סגירת חשמל, מים וגז בזירה`  ],
     " במהלך האירוע": [
      `אספקת אמצעי חילוץ ופינוי במקרה הצורך`,
         `הערכות להארת הזירה בשעות החושך`  ]        },
      color: "#FFA133"
    },
    {
      role: "מידע לציבור",
      id: 5,
      tasksByPhases: 
      {   "מענה ראשוני": [ 
`פרסום ראשוני על הזירה כמה שיותר מהר`  ],
     " במהלך האירוע": [
     `פרסום הנחייה להתרחקות סקרנים ומיקום ונציג קליטת מתנדבים`,
          ]        },
      color: "#9f4868ff",
      messages: [
    "\u202Bתושבות ותושבים יקרים שימו לב: \u202Bהתקבלה הודעה על דליפה של חומר מסוכן (לפרט לפי הידוע). \u202Bמקור הדליפה הוא ב _. \u202Bהאירוע מטופל על ידי צוות הצ\"חי וכוחות החרום. \u202Bהתושבים מתבקשים להישאר בבתים ולסגור חלונות. \u202Bבמידת האפשר יש להניח מגבות רטובות על הפתחים. \u202Bהודעה נוספת תצא בעשר הדקות הקרובות. \u202Bיש לדווח על כל אירוע חריג לחמ\"ל הצ\"חי בטלפון _____."
  ]
    },
    {
      role: 'רפואה',
      id:6,
      tasksByPhases: {
        "מענה ראשוני": [
`הזעקת הצוות הרפואי לאירוע ומתן ע"ר לפי צורך ` ],
"במהלך האירוע":[
  `חבירה לכוחות ההצלה ומד"א להמשך טיפול`
]
    },
      color:"#8f6a45ff"
    },
    {
      role: 'חינוך',
      id:7,
     tasksByPhases: {
  "מענה ראשוני": [
      "חסר מידע"
  ],
  "במהלך האירוע": [
`חסר מידע` ]
    },
    
      color:"#1a6da9ff"
    },
  ],
      
    },
    
  
  ];
  
  export default emergencyScenarios;